IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
<module name="CTRL_MMR0_CFG0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG0_PID" acronym="CFG0_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="" range="31 - 16" rwaccess="R"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="" range="10 - 8" rwaccess="R"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="" range="7 - 6" rwaccess="R"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x19" description="" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_MMR_CFG1" acronym="CFG0_MMR_CFG1" offset="0x8" width="32" description="">
		<bitfield id="MMR_CFG1_PROXY_EN" width="1" begin="31" end="31" resetval="0x1" description="Proxy addressing activated" range="31" rwaccess="R"/> 
		<bitfield id="MMR_CFG1_PARTITIONS" width="8" begin="7" end="0" resetval="0x191" description="Indicates present partitions" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_JTAGID" acronym="CFG0_JTAGID" offset="0x14" width="32" description="">
		<bitfield id="JTAGID_VARIANT" width="4" begin="31" end="28" resetval="0x1" description="Used to indicate new PGs" range="31 - 28" rwaccess="R"/> 
		<bitfield id="JTAGID_PARTNO" width="16" begin="27" end="12" resetval="0x47928" description="Part number for boundary scan" range="27 - 12" rwaccess="R"/> 
		<bitfield id="JTAGID_MFG" width="11" begin="11" end="1" resetval="0x23" description="Indicates manufacturer" range="11 - 1" rwaccess="R"/> 
		<bitfield id="JTAGID_LSB" width="1" begin="0" end="0" resetval="0x1" description="Always 1" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_JTAG_USER_ID" acronym="CFG0_JTAG_USER_ID" offset="0x18" width="32" description="">
		<bitfield id="JTAG_USER_ID_USERCODE" width="32" begin="31" end="0" resetval="0x0" description="Device information" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_MAIN_DEVSTAT" acronym="CFG0_MAIN_DEVSTAT" offset="0x30" width="32" description="">
		<bitfield id="MAIN_DEVSTAT_BOOTMODE" width="16" begin="15" end="0" resetval="0x0" description="Specifies the device Primary and Backup boot media." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_BOOTCFG" acronym="CFG0_MAIN_BOOTCFG" offset="0x34" width="32" description="">
		<bitfield id="MAIN_BOOTCFG_BOOTMODE" width="16" begin="15" end="0" resetval="0x0" description="Specifies the device Primary and Backup boot media as latched at PORz" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_BOOT_PROGRESS" acronym="CFG0_BOOT_PROGRESS" offset="0x44" width="32" description="">
		<bitfield id="BOOT_PROGRESS_PROGRESS" width="32" begin="31" end="0" resetval="0x0" description="Written by ROM to indicate boot progression.  Values and their meaning are determined by the ROM." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_DEVICE_FEATURE0" acronym="CFG0_DEVICE_FEATURE0" offset="0x60" width="32" description="">
		<bitfield id="DEVICE_FEATURE0_R5FSS1_CORE1" width="1" begin="19" end="19" resetval="0x0" description="R5FSS1 CPU1  activated when set.  CPU0 must also be activated." range="19" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_R5FSS1_CORE0" width="1" begin="18" end="18" resetval="0x0" description="R5FSS1 CPU0  activated when set." range="18" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_R5FSS0_CORE1" width="1" begin="17" end="17" resetval="0x0" description="R5FSS0 CPU1  activated when set.  CPU0 must also be activated." range="17" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_R5FSS0_CORE0" width="1" begin="16" end="16" resetval="0x0" description="R5FSS0 CPU0  activated when set." range="16" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_MPU_CLUSTER0_CORE1" width="1" begin="1" end="1" resetval="0x0" description="MPU Cluster0 Core 1 is activated when set" range="1" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_MPU_CLUSTER0_CORE0" width="1" begin="0" end="0" resetval="0x0" description="MPU Cluster0 Core 0 is activated when set" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_DEVICE_FEATURE2" acronym="CFG0_DEVICE_FEATURE2" offset="0x68" width="32" description="">
		<bitfield id="DEVICE_FEATURE2_CRYPTO_PKA_EN" width="1" begin="10" end="10" resetval="0x0" description="SA2_UL Crypto Module PKA activated" range="10" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_CRYPTO_ENCR_EN" width="1" begin="9" end="9" resetval="0x0" description="SA2_UL Crypto Module AES/3DES/DBRG activated" range="9" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_CRYPTO_SHA_EN" width="1" begin="8" end="8" resetval="0x0" description="SA2_UL Crypto Module SHA/MD5 activated" range="8" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_AES_AUTH_EN" width="1" begin="7" end="7" resetval="0x0" description="AES authentication is activated in FlashSS and DMSC when set" range="7" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_MCAN_FD_MODE" width="1" begin="0" end="0" resetval="0x0" description="FD mode is supported on MCAN[1:0] when set" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_DEVICE_FEATURE6" acronym="CFG0_DEVICE_FEATURE6" offset="0x78" width="32" description="">
		<bitfield id="RESERVED" width="1" begin="26" end="26" resetval="0x0" description="Main Domain Reserved 2 LPSC is activated when set" range="26" rwaccess="N/A"/> 
		<bitfield id="RESERVED" width="1" begin="25" end="25" resetval="0x0" description="Main Domain Reserved 1 LPSC is activated when set" range="25" rwaccess="N/A"/> 
		<bitfield id="RESERVED" width="1" begin="24" end="24" resetval="0x0" description="Main Domain Reserved 0 LPSC is activated when set" range="24" rwaccess="N/A"/> 
		<bitfield id="DEVICE_FEATURE6_SPARE1" width="1" begin="17" end="17" resetval="0x0" description="Spare1 LPSC is activated when set" range="17" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE6_SPARE0" width="1" begin="16" end="16" resetval="0x0" description="Spare0 LPSC is activated when set" range="16" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE6_SA2_UL" width="1" begin="5" end="5" resetval="0x0" description="MAIN domain security accelerator is activated when set" range="5" rwaccess="R"/>
	</register>
	<register id="CFG0_MAC_ID0" acronym="CFG0_MAC_ID0" offset="0x200" width="32" description="">
		<bitfield id="MAC_ID0_MACID_LO" width="32" begin="31" end="0" resetval="0x0" description="32 lsbs of MAC address" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAC_ID1" acronym="CFG0_MAC_ID1" offset="0x204" width="32" description="">
		<bitfield id="MAC_ID1_MACID_HI" width="16" begin="15" end="0" resetval="0x0" description="16 msbs of MAC address" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PCI_DEVICE_ID0" acronym="CFG0_PCI_DEVICE_ID0" offset="0x210" width="32" description="">
		<bitfield id="PCI_DEVICE_ID0_ID0" width="32" begin="31" end="0" resetval="0x2953842764" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PCI_DEVICE_ID1" acronym="CFG0_PCI_DEVICE_ID1" offset="0x214" width="32" description="">
		<bitfield id="PCI_DEVICE_ID1_ID1" width="32" begin="31" end="0" resetval="0x2953842764" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USB_DEVICE_ID0" acronym="CFG0_USB_DEVICE_ID0" offset="0x220" width="32" description="">
		<bitfield id="USB_DEVICE_ID0_ID0" width="32" begin="31" end="0" resetval="0x1634010193" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USB_DEVICE_ID1" acronym="CFG0_USB_DEVICE_ID1" offset="0x224" width="32" description="">
		<bitfield id="USB_DEVICE_ID1_ID1" width="32" begin="31" end="0" resetval="0x1634010193" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_GP_SW0" acronym="CFG0_GP_SW0" offset="0x230" width="32" description="">
		<bitfield id="GP_SW0_VAL" width="32" begin="31" end="0" resetval="0x0" description="general purpose value" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_GP_SW1" acronym="CFG0_GP_SW1" offset="0x234" width="32" description="">
		<bitfield id="GP_SW1_VAL" width="32" begin="31" end="0" resetval="0x0" description="general purpose value" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_GP_SW2" acronym="CFG0_GP_SW2" offset="0x238" width="32" description="">
		<bitfield id="GP_SW2_VAL" width="32" begin="31" end="0" resetval="0x0" description="general purpose value" range="31 - 0" rwaccess="R"/>
	</register>
