IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_CLAIMREG_P0_R0_READONLY" acronym="CFG0_CLAIMREG_P0_R0_READONLY" offset="0x1100" width="32" description="">
		<bitfield id="CLAIMREG_P0_R0_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R1_READONLY" acronym="CFG0_CLAIMREG_P0_R1_READONLY" offset="0x1104" width="32" description="">
		<bitfield id="CLAIMREG_P0_R1_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R2_READONLY" acronym="CFG0_CLAIMREG_P0_R2_READONLY" offset="0x1108" width="32" description="">
		<bitfield id="CLAIMREG_P0_R2_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R3_READONLY" acronym="CFG0_CLAIMREG_P0_R3_READONLY" offset="0x110C" width="32" description="">
		<bitfield id="CLAIMREG_P0_R3_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R4_READONLY" acronym="CFG0_CLAIMREG_P0_R4_READONLY" offset="0x1110" width="32" description="">
		<bitfield id="CLAIMREG_P0_R4_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R5_READONLY" acronym="CFG0_CLAIMREG_P0_R5_READONLY" offset="0x1114" width="32" description="">
		<bitfield id="CLAIMREG_P0_R5_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R6_READONLY" acronym="CFG0_CLAIMREG_P0_R6_READONLY" offset="0x1118" width="32" description="">
		<bitfield id="CLAIMREG_P0_R6_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_PID_PROXY" acronym="CFG0_PID_PROXY" offset="0x2000" width="32" description="">
		<bitfield id="PID_MSB16_PROXY" width="16" begin="31" end="16" resetval="0x24960" description="" range="31 - 16" rwaccess="R"/> 
		<bitfield id="PID_MISC_PROXY" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R"/> 
		<bitfield id="PID_MAJOR_PROXY" width="3" begin="10" end="8" resetval="0x2" description="" range="10 - 8" rwaccess="R"/> 
		<bitfield id="PID_CUSTOM_PROXY" width="2" begin="7" end="6" resetval="0x0" description="" range="7 - 6" rwaccess="R"/> 
		<bitfield id="PID_MINOR_PROXY" width="6" begin="5" end="0" resetval="0x19" description="" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_MMR_CFG1_PROXY" acronym="CFG0_MMR_CFG1_PROXY" offset="0x2008" width="32" description="">
		<bitfield id="MMR_CFG1_PROXY_EN_PROXY" width="1" begin="31" end="31" resetval="0x1" description="Proxy addressing activated" range="31" rwaccess="R"/> 
		<bitfield id="MMR_CFG1_PARTITIONS_PROXY" width="8" begin="7" end="0" resetval="0x191" description="Indicates present partitions" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_JTAGID_PROXY" acronym="CFG0_JTAGID_PROXY" offset="0x2014" width="32" description="">
		<bitfield id="JTAGID_VARIANT_PROXY" width="4" begin="31" end="28" resetval="0x1" description="Used to indicate new PGs" range="31 - 28" rwaccess="R"/> 
		<bitfield id="JTAGID_PARTNO_PROXY" width="16" begin="27" end="12" resetval="0x47928" description="Part number for boundary scan" range="27 - 12" rwaccess="R"/> 
		<bitfield id="JTAGID_MFG_PROXY" width="11" begin="11" end="1" resetval="0x23" description="Indicates manufacturer" range="11 - 1" rwaccess="R"/> 
		<bitfield id="JTAGID_LSB_PROXY" width="1" begin="0" end="0" resetval="0x1" description="Always 1" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_JTAG_USER_ID_PROXY" acronym="CFG0_JTAG_USER_ID_PROXY" offset="0x2018" width="32" description="">
		<bitfield id="JTAG_USER_ID_USERCODE_PROXY" width="32" begin="31" end="0" resetval="0x0" description="Device information" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_MAIN_DEVSTAT_PROXY" acronym="CFG0_MAIN_DEVSTAT_PROXY" offset="0x2030" width="32" description="">
		<bitfield id="MAIN_DEVSTAT_BOOTMODE_PROXY" width="16" begin="15" end="0" resetval="0x0" description="Specifies the device Primary and Backup boot media." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_BOOTCFG_PROXY" acronym="CFG0_MAIN_BOOTCFG_PROXY" offset="0x2034" width="32" description="">
		<bitfield id="MAIN_BOOTCFG_BOOTMODE_PROXY" width="16" begin="15" end="0" resetval="0x0" description="Specifies the device Primary and Backup boot media as latched at PORz" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_BOOT_PROGRESS_PROXY" acronym="CFG0_BOOT_PROGRESS_PROXY" offset="0x2044" width="32" description="">
		<bitfield id="BOOT_PROGRESS_PROGRESS_PROXY" width="32" begin="31" end="0" resetval="0x0" description="Written by ROM to indicate boot progression.  Values and their meaning are determined by the ROM." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_DEVICE_FEATURE0_PROXY" acronym="CFG0_DEVICE_FEATURE0_PROXY" offset="0x2060" width="32" description="">
		<bitfield id="DEVICE_FEATURE0_R5FSS1_CORE1_PROXY" width="1" begin="19" end="19" resetval="0x0" description="R5FSS1 CPU1  activated when set.  CPU0 must also be activated." range="19" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_R5FSS1_CORE0_PROXY" width="1" begin="18" end="18" resetval="0x0" description="R5FSS1 CPU0  activated when set." range="18" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_R5FSS0_CORE1_PROXY" width="1" begin="17" end="17" resetval="0x0" description="R5FSS0 CPU1  activated when set.  CPU0 must also be activated." range="17" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_R5FSS0_CORE0_PROXY" width="1" begin="16" end="16" resetval="0x0" description="R5FSS0 CPU0  activated when set." range="16" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_MPU_CLUSTER0_CORE1_PROXY" width="1" begin="1" end="1" resetval="0x0" description="MPU Cluster0 Core 1 is activated when set" range="1" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE0_MPU_CLUSTER0_CORE0_PROXY" width="1" begin="0" end="0" resetval="0x0" description="MPU Cluster0 Core 0 is activated when set" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_DEVICE_FEATURE2_PROXY" acronym="CFG0_DEVICE_FEATURE2_PROXY" offset="0x2068" width="32" description="">
		<bitfield id="DEVICE_FEATURE2_CRYPTO_PKA_EN_PROXY" width="1" begin="10" end="10" resetval="0x0" description="SA2_UL Crypto Module PKA activated" range="10" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_CRYPTO_ENCR_EN_PROXY" width="1" begin="9" end="9" resetval="0x0" description="SA2_UL Crypto Module AES/3DES/DBRG activated" range="9" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_CRYPTO_SHA_EN_PROXY" width="1" begin="8" end="8" resetval="0x0" description="SA2_UL Crypto Module SHA/MD5 activated" range="8" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_AES_AUTH_EN_PROXY" width="1" begin="7" end="7" resetval="0x0" description="AES authentication is activated in FlashSS and DMSC when set" range="7" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE2_MCAN_FD_MODE_PROXY" width="1" begin="0" end="0" resetval="0x0" description="FD mode is supported on MCAN[1:0] when set" range="0" rwaccess="R"/>
	</register>
