IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_DEVICE_FEATURE6_PROXY" acronym="CFG0_DEVICE_FEATURE6_PROXY" offset="0x2078" width="32" description="">
		<bitfield id="RESERVED" width="1" begin="26" end="26" resetval="0x0" description="Main Domain Reserved 2 LPSC is activated when set" range="26" rwaccess="N/A"/> 
		<bitfield id="RESERVED" width="1" begin="25" end="25" resetval="0x0" description="Main Domain Reserved 1 LPSC is activated when set" range="25" rwaccess="N/A"/> 
		<bitfield id="RESERVED" width="1" begin="24" end="24" resetval="0x0" description="Main Domain Reserved 0 LPSC is activated when set" range="24" rwaccess="N/A"/> 
		<bitfield id="DEVICE_FEATURE6_SPARE1_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Spare1 LPSC is activated when set" range="17" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE6_SPARE0_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Spare0 LPSC is activated when set" range="16" rwaccess="R"/> 
		<bitfield id="DEVICE_FEATURE6_SA2_UL_PROXY" width="1" begin="5" end="5" resetval="0x0" description="MAIN domain security accelerator is activated when set" range="5" rwaccess="R"/>
	</register>
	<register id="CFG0_MAC_ID0_PROXY" acronym="CFG0_MAC_ID0_PROXY" offset="0x2200" width="32" description="">
		<bitfield id="MAC_ID0_MACID_LO_PROXY" width="32" begin="31" end="0" resetval="0x0" description="32 lsbs of MAC address" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAC_ID1_PROXY" acronym="CFG0_MAC_ID1_PROXY" offset="0x2204" width="32" description="">
		<bitfield id="MAC_ID1_MACID_HI_PROXY" width="16" begin="15" end="0" resetval="0x0" description="16 msbs of MAC address" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PCI_DEVICE_ID0_PROXY" acronym="CFG0_PCI_DEVICE_ID0_PROXY" offset="0x2210" width="32" description="">
		<bitfield id="PCI_DEVICE_ID0_ID0_PROXY" width="32" begin="31" end="0" resetval="0x2953842764" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PCI_DEVICE_ID1_PROXY" acronym="CFG0_PCI_DEVICE_ID1_PROXY" offset="0x2214" width="32" description="">
		<bitfield id="PCI_DEVICE_ID1_ID1_PROXY" width="32" begin="31" end="0" resetval="0x2953842764" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USB_DEVICE_ID0_PROXY" acronym="CFG0_USB_DEVICE_ID0_PROXY" offset="0x2220" width="32" description="">
		<bitfield id="USB_DEVICE_ID0_ID0_PROXY" width="32" begin="31" end="0" resetval="0x1634010193" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USB_DEVICE_ID1_PROXY" acronym="CFG0_USB_DEVICE_ID1_PROXY" offset="0x2224" width="32" description="">
		<bitfield id="USB_DEVICE_ID1_ID1_PROXY" width="32" begin="31" end="0" resetval="0x1634010193" description="ROM can optionally update this register with a 32 bit value from Customer OTP." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_GP_SW0_PROXY" acronym="CFG0_GP_SW0_PROXY" offset="0x2230" width="32" description="">
		<bitfield id="GP_SW0_VAL_PROXY" width="32" begin="31" end="0" resetval="0x0" description="general purpose value" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_GP_SW1_PROXY" acronym="CFG0_GP_SW1_PROXY" offset="0x2234" width="32" description="">
		<bitfield id="GP_SW1_VAL_PROXY" width="32" begin="31" end="0" resetval="0x0" description="general purpose value" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_GP_SW2_PROXY" acronym="CFG0_GP_SW2_PROXY" offset="0x2238" width="32" description="">
		<bitfield id="GP_SW2_VAL_PROXY" width="32" begin="31" end="0" resetval="0x0" description="general purpose value" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_GP_SW3_PROXY" acronym="CFG0_GP_SW3_PROXY" offset="0x223C" width="32" description="">
		<bitfield id="GP_SW3_VAL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="general purpose value" range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CBA_ERR_STAT_PROXY" acronym="CFG0_CBA_ERR_STAT_PROXY" offset="0x2270" width="32" description="">
		<bitfield id="CBA_ERR_STAT_DBG_CBA_ERR_PROXY" width="1" begin="31" end="31" resetval="0x0" description="" range="31" rwaccess="R"/> 
		<bitfield id="CBA_ERR_STAT_MCU_CBA_ERR_PROXY" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R"/> 
		<bitfield id="CBA_ERR_STAT_MAIN_INFRA_CBA_ERR_PROXY" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R"/> 
		<bitfield id="CBA_ERR_STAT_MAIN_CBA_ERR_PROXY" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_LOCK0_KICK0_PROXY" acronym="CFG0_LOCK0_KICK0_PROXY" offset="0x3008" width="32" description="">
		<bitfield id="LOCK0_KICK0_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK0_KICK1_PROXY" acronym="CFG0_LOCK0_KICK1_PROXY" offset="0x300C" width="32" description="">
		<bitfield id="LOCK0_KICK1_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_intr_raw_status_PROXY" acronym="CFG0_intr_raw_status_PROXY" offset="0x3010" width="32" description="">
		<bitfield id="PROXY_ERR_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="KICK_ERR_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="ADDR_ERR_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PROT_ERR_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG0_intr_enabled_status_clear_PROXY" acronym="CFG0_intr_enabled_status_clear_PROXY" offset="0x3014" width="32" description="">
		<bitfield id="ENABLED_PROXY_ERR_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/> 
		<bitfield id="ENABLED_KICK_ERR_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/> 
		<bitfield id="ENABLED_ADDR_ERR_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="ENABLED_PROT_ERR_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG0_intr_enable_PROXY" acronym="CFG0_intr_enable_PROXY" offset="0x3018" width="32" description="">
		<bitfield id="PROXY_ERR_EN_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="KICK_ERR_EN_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="ADDR_ERR_EN_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="PROT_ERR_EN_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register>
