IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_intr_enable_clear_PROXY" acronym="CFG0_intr_enable_clear_PROXY" offset="0x301C" width="32" description="">
		<bitfield id="PROXY_ERR_EN_CLR_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/> 
		<bitfield id="KICK_ERR_EN_CLR_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/> 
		<bitfield id="ADDR_ERR_EN_CLR_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="PROT_ERR_EN_CLR_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG0_eoi_PROXY" acronym="CFG0_eoi_PROXY" offset="0x3020" width="32" description="">
		<bitfield id="EOI_VECTOR_PROXY" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value. Write this with interrupt distribution value in the chip." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_fault_address_PROXY" acronym="CFG0_fault_address_PROXY" offset="0x3024" width="32" description="">
		<bitfield id="FAULT_ADDR_PROXY" width="32" begin="31" end="0" resetval="0x0" description="Fault Address." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_fault_type_status_PROXY" acronym="CFG0_fault_type_status_PROXY" offset="0x3028" width="32" description="">
		<bitfield id="FAULT_NS_PROXY" width="1" begin="6" end="6" resetval="0x0" description="Non-secure access." range="6" rwaccess="R"/> 
		<bitfield id="FAULT_TYPE_PROXY" width="6" begin="5" end="0" resetval="0x0" description="Fault Type   10_0000 = Supervisor read  fault  - priv = 1 dir = 1 dtype != 1    01_0000 = Supervisor write fault  - priv = 1 dir = 0   00_1000 = Supervisor execute fault - priv = 1 dir = 1 dtype = 1   00_0100 = User read  fault - priv = 0 dir = 1 dtype = 1   00_0010 = User write fault - priv = 0 dir = 0   00_0001 = User execute fault - priv = 0 dir = 1 dtype = 1   00_0000 = No fault" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_fault_attr_status_PROXY" acronym="CFG0_fault_attr_status_PROXY" offset="0x302C" width="32" description="">
		<bitfield id="FAULT_XID_PROXY" width="12" begin="31" end="20" resetval="0x0" description="XID." range="31 - 20" rwaccess="R"/> 
		<bitfield id="FAULT_ROUTEID_PROXY" width="12" begin="19" end="8" resetval="0x0" description="Route ID." range="19 - 8" rwaccess="R"/> 
		<bitfield id="FAULT_PRIVID_PROXY" width="8" begin="7" end="0" resetval="0x0" description="Privilege ID." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_fault_clear_PROXY" acronym="CFG0_fault_clear_PROXY" offset="0x3030" width="32" description="">
		<bitfield id="FAULT_CLR_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a 0 has no effect." range="0" rwaccess="W"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R0" acronym="CFG0_CLAIMREG_P0_R0" offset="0x3100" width="32" description="">
		<bitfield id="CLAIMREG_P0_R0" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R1" acronym="CFG0_CLAIMREG_P0_R1" offset="0x3104" width="32" description="">
		<bitfield id="CLAIMREG_P0_R1" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R2" acronym="CFG0_CLAIMREG_P0_R2" offset="0x3108" width="32" description="">
		<bitfield id="CLAIMREG_P0_R2" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R3" acronym="CFG0_CLAIMREG_P0_R3" offset="0x310C" width="32" description="">
		<bitfield id="CLAIMREG_P0_R3" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R4" acronym="CFG0_CLAIMREG_P0_R4" offset="0x3110" width="32" description="">
		<bitfield id="CLAIMREG_P0_R4" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R5" acronym="CFG0_CLAIMREG_P0_R5" offset="0x3114" width="32" description="">
		<bitfield id="CLAIMREG_P0_R5" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P0_R6" acronym="CFG0_CLAIMREG_P0_R6" offset="0x3118" width="32" description="">
		<bitfield id="CLAIMREG_P0_R6" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 0" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USB0_PHY_CTRL" acronym="CFG0_USB0_PHY_CTRL" offset="0x4008" width="32" description="">
		<bitfield id="USB0_PHY_CTRL_CORE_VOLTAGE" width="1" begin="31" end="31" resetval="0x1" description="Selects the USB PHY Core Voltage" range="31" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_LOOPBACK_MODE" width="2" begin="17" end="16" resetval="0x0" description="Activates USB0 PHY loopback operation" range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_STANDALONE" width="1" begin="15" end="15" resetval="0x0" description="Activates USB0 PHY as a standalone PLL" range="15" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_CLKOUT_ON" width="1" begin="11" end="11" resetval="0x0" description="Controls USB0 PLL clock output" range="11" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_CLKOUT_SEL" width="2" begin="9" end="8" resetval="0x0" description="Selects the frequency of the USB0 PLL output clock" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_REF_SEL" width="4" begin="3" end="0" resetval="0x4" description="Indicates the frequency of the REF_CLOCK input used by the USB PLL.  This value should match the frequency value of either the HFOSC0 or HFOSC1 oscillator as selected by the USB0_CLKSEL register" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ENET1_CTRL" acronym="CFG0_ENET1_CTRL" offset="0x4044" width="32" description="">
		<bitfield id="ENET1_CTRL_RGMII_ID_MODE" width="1" begin="4" end="4" resetval="0x0" description="Port1 RGMII internal transmit delay selection" range="4" rwaccess="R/W"/> 
		<bitfield id="ENET1_CTRL_PORT_MODE_SEL" width="3" begin="2" end="0" resetval="0x2" description="Selects Ethernet switch Port1 interface" range="2 - 0" rwaccess="R/W"/>
	</register>
