IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_ENET2_CTRL" acronym="CFG0_ENET2_CTRL" offset="0x4048" width="32" description="">
		<bitfield id="ENET2_CTRL_RGMII_ID_MODE" width="1" begin="4" end="4" resetval="0x0" description="Port2 RGMII internal transmit delay selection" range="4" rwaccess="R/W"/> 
		<bitfield id="ENET2_CTRL_PORT_MODE_SEL" width="3" begin="2" end="0" resetval="0x2" description="Selects Ethernet switch Port2 interface" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PCIE0_CTRL" acronym="CFG0_PCIE0_CTRL" offset="0x4070" width="32" description="">
		<bitfield id="PCIE0_CTRL_MODE_SEL" width="1" begin="7" end="7" resetval="0x0" description="Selects the operating mode" range="7" rwaccess="R/W"/> 
		<bitfield id="PCIE0_CTRL_GENERATION_SEL" width="2" begin="1" end="0" resetval="0x1" description="Configures  the PCIe generation support in the PCIe capabilities linked-list" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SERDES0_LN0_CTRL" acronym="CFG0_SERDES0_LN0_CTRL" offset="0x4080" width="32" description="">
		<bitfield id="SERDES0_LN0_CTRL_LANE_FUNC_SEL" width="2" begin="1" end="0" resetval="0x0" description="Selects the SERDES0 lane0 function" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ADC0_TRIM" acronym="CFG0_ADC0_TRIM" offset="0x40C0" width="32" description="">
		<bitfield id="ADC0_TRIM_TRIM5" width="3" begin="26" end="24" resetval="0x0" description="Trims Nonlinearities from ADC" range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM4" width="3" begin="23" end="21" resetval="0x0" description="Trims Nonlinearities from ADC" range="23 - 21" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM3" width="3" begin="20" end="18" resetval="0x0" description="Trims Nonlinearities from ADC" range="20 - 18" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM2" width="4" begin="17" end="14" resetval="0x0" description="Trims Nonlinearities from ADC" range="17 - 14" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM1" width="4" begin="13" end="10" resetval="0x0" description="Trims Nonlinearities from ADC" range="13 - 10" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_ENABLE_CALB" width="5" begin="9" end="5" resetval="0x0" description="Trims Nonlinearities from ADC" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_ENABLE_CAL" width="5" begin="4" end="0" resetval="0x0" description="Trims Nonlinearities from ADC" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SERDES0_CTRL" acronym="CFG0_SERDES0_CTRL" offset="0x40E0" width="32" description="">
		<bitfield id="SERDES0_CTRL_REF_SEL" width="1" begin="12" end="12" resetval="0x0" description="REFCLK output select" range="12" rwaccess="R/W"/> 
		<bitfield id="SERDES0_CTRL_RET_EN" width="1" begin="8" end="8" resetval="0x0" description="Retention activate" range="8" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG0_CTRL0" acronym="CFG0_ICSSG0_CTRL0" offset="0x4100" width="32" description="">
		<bitfield id="ICSSG0_CTRL0_RGMII0_ID_MODE" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G0 RGMII0 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG0_CTRL0_GPM_BIDI" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G0 PRU0_GPO pins.  Each bit n controls the corresponding PRG0_PRU0GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG0_CTRL1" acronym="CFG0_ICSSG0_CTRL1" offset="0x4104" width="32" description="">
		<bitfield id="ICSSG0_CTRL1_RGMII1_ID_MODE" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G0 RGMII1 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG0_CTRL1_GPM_BIDI" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G0 PRU1_GPO pins.  Each bit n controls the corresponding PRG0_PRU1GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG1_CTRL0" acronym="CFG0_ICSSG1_CTRL0" offset="0x4110" width="32" description="">
		<bitfield id="ICSSG1_CTRL0_RGMII0_ID_MODE" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G1 RGMII0 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG1_CTRL0_GPM_BIDI" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G1 PRU0_GPO pins.  Each bit n controls the corresponding PRG1_PRU0GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG1_CTRL1" acronym="CFG0_ICSSG1_CTRL1" offset="0x4114" width="32" description="">
		<bitfield id="ICSSG1_CTRL1_RGMII1_ID_MODE" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G1 RGMII1 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG1_CTRL1_GPM_BIDI" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G1 PRU1_GPO pins.  Each bit n controls the corresponding PRG1_PRU1GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM_TB_CLKEN" acronym="CFG0_EPWM_TB_CLKEN" offset="0x4130" width="32" description="">
		<bitfield id="EPWM_TB_CLKEN_EPWM8_TB_CLKEN" width="1" begin="8" end="8" resetval="0x0" description="Activates Timebase Clock of EPWM8 When Set" range="8" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM7_TB_CLKEN" width="1" begin="7" end="7" resetval="0x0" description="Activates Timebase Clock of EPWM7 When Set" range="7" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM6_TB_CLKEN" width="1" begin="6" end="6" resetval="0x0" description="Activates Timebase Clock of EPWM6 When Set" range="6" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM5_TB_CLKEN" width="1" begin="5" end="5" resetval="0x0" description="Activates Timebase Clock of EPWM5 When Set" range="5" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM4_TB_CLKEN" width="1" begin="4" end="4" resetval="0x0" description="Activates Timebase Clock of EPWM4 When Set" range="4" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM3_TB_CLKEN" width="1" begin="3" end="3" resetval="0x0" description="Activates Timebase Clock of EPWM3 When Set" range="3" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM2_TB_CLKEN" width="1" begin="2" end="2" resetval="0x0" description="Activates Timebase Clock of EPWM2 When Set" range="2" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM1_TB_CLKEN" width="1" begin="1" end="1" resetval="0x0" description="Activates Timebase Clock of EPWM1 When Set" range="1" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM0_TB_CLKEN" width="1" begin="0" end="0" resetval="0x0" description="Activates Timebase Clock of EPWM0 When Set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM_TB_CLKEN_SET" acronym="CFG0_EPWM_TB_CLKEN_SET" offset="0x4134" width="32" description="">
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM8_TB_CLKEN" width="1" begin="8" end="8" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM8" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM7_TB_CLKEN" width="1" begin="7" end="7" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM7" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM6_TB_CLKEN" width="1" begin="6" end="6" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM6" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM5_TB_CLKEN" width="1" begin="5" end="5" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM5" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM4_TB_CLKEN" width="1" begin="4" end="4" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM4" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM3_TB_CLKEN" width="1" begin="3" end="3" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM3" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM2_TB_CLKEN" width="1" begin="2" end="2" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM2" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM1_TB_CLKEN" width="1" begin="1" end="1" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM1" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM0_TB_CLKEN" width="1" begin="0" end="0" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM0" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG0_EPWM_TB_CLKEN_CLR" acronym="CFG0_EPWM_TB_CLKEN_CLR" offset="0x4138" width="32" description="">
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM8_TB_CLKEN" width="1" begin="8" end="8" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM8" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM7_TB_CLKEN" width="1" begin="7" end="7" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM7" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM6_TB_CLKEN" width="1" begin="6" end="6" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM6" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM5_TB_CLKEN" width="1" begin="5" end="5" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM5" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM4_TB_CLKEN" width="1" begin="4" end="4" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM4" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM3_TB_CLKEN" width="1" begin="3" end="3" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM3" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM2_TB_CLKEN" width="1" begin="2" end="2" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM2" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM1_TB_CLKEN" width="1" begin="1" end="1" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM1" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM0_TB_CLKEN" width="1" begin="0" end="0" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM0" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG0_EPWM0_CTRL" acronym="CFG0_EPWM0_CTRL" offset="0x4140" width="32" description="">
		<bitfield id="EPWM0_CTRL_SYNCIN_SEL" width="3" begin="10" end="8" resetval="0x0" description="Selects the source of the EPWM0 synchronization input" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="EPWM0_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
