IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_EPWM1_CTRL" acronym="CFG0_EPWM1_CTRL" offset="0x4144" width="32" description="">
		<bitfield id="EPWM1_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM2_CTRL" acronym="CFG0_EPWM2_CTRL" offset="0x4148" width="32" description="">
		<bitfield id="EPWM2_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM3_CTRL" acronym="CFG0_EPWM3_CTRL" offset="0x414C" width="32" description="">
		<bitfield id="EPWM3_CTRL_SYNCIN_SEL" width="3" begin="10" end="8" resetval="0x0" description="Selects the source of the EPWM3 synchronization input" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="EPWM3_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM4_CTRL" acronym="CFG0_EPWM4_CTRL" offset="0x4150" width="32" description="">
		<bitfield id="EPWM4_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM5_CTRL" acronym="CFG0_EPWM5_CTRL" offset="0x4154" width="32" description="">
		<bitfield id="EPWM5_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM6_CTRL" acronym="CFG0_EPWM6_CTRL" offset="0x4158" width="32" description="">
		<bitfield id="EPWM6_CTRL_SYNCIN_SEL" width="3" begin="10" end="8" resetval="0x0" description="Selects the source of the EPWM6 synchronization input" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="EPWM6_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM7_CTRL" acronym="CFG0_EPWM7_CTRL" offset="0x415C" width="32" description="">
		<bitfield id="EPWM7_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM8_CTRL" acronym="CFG0_EPWM8_CTRL" offset="0x4160" width="32" description="">
		<bitfield id="EPWM8_CTRL_EALLOW" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SOCA_SEL" acronym="CFG0_SOCA_SEL" offset="0x4170" width="32" description="">
		<bitfield id="SOCA_SEL_SOCA_SEL" width="2" begin="1" end="0" resetval="0x0" description="Selects the SOC A output source" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SOCB_SEL" acronym="CFG0_SOCB_SEL" offset="0x4174" width="32" description="">
		<bitfield id="SOCB_SEL_SOCB_SEL" width="2" begin="1" end="0" resetval="0x0" description="Selects the SOC B output source" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP0_CTRL" acronym="CFG0_EQEP0_CTRL" offset="0x4180" width="32" description="">
		<bitfield id="EQEP0_CTRL_SOCA_SEL" width="5" begin="4" end="0" resetval="0x0" description="Selects the source of SOCA input for EQEP0" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP1_CTRL" acronym="CFG0_EQEP1_CTRL" offset="0x4184" width="32" description="">
		<bitfield id="EQEP1_CTRL_SOCA_SEL" width="5" begin="4" end="0" resetval="0x0" description="Selects the source of SOCA input for EQEP1" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP2_CTRL" acronym="CFG0_EQEP2_CTRL" offset="0x4188" width="32" description="">
		<bitfield id="EQEP2_CTRL_SOCA_SEL" width="5" begin="4" end="0" resetval="0x0" description="Selects the source of SOCA input for EQEP2" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP_STAT" acronym="CFG0_EQEP_STAT" offset="0x41A0" width="32" description="">
		<bitfield id="EQEP_STAT_PHASE_ERR2" width="1" begin="2" end="2" resetval="0x0" description="EQEP2 Phase error status" range="2" rwaccess="R"/> 
		<bitfield id="EQEP_STAT_PHASE_ERR1" width="1" begin="1" end="1" resetval="0x0" description="EQEP1 Phase error status" range="1" rwaccess="R"/> 
		<bitfield id="EQEP_STAT_PHASE_ERR0" width="1" begin="0" end="0" resetval="0x0" description="EQEP0 Phase error status" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_SDIO1_CTRL" acronym="CFG0_SDIO1_CTRL" offset="0x41B4" width="32" description="">
		<bitfield id="SDIO1_CTRL_DRV_STR" width="5" begin="4" end="0" resetval="0x0" description="Selects the SDIO drive strength" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER1_CTRL" acronym="CFG0_TIMER1_CTRL" offset="0x4204" width="32" description="">
		<bitfield id="TIMER1_CTRL_CASCADE_EN" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER1 to TIMER0" range="8" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER3_CTRL" acronym="CFG0_TIMER3_CTRL" offset="0x420C" width="32" description="">
		<bitfield id="TIMER3_CTRL_CASCADE_EN" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER3 to TIMER2" range="8" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER5_CTRL" acronym="CFG0_TIMER5_CTRL" offset="0x4214" width="32" description="">
		<bitfield id="TIMER5_CTRL_CASCADE_EN" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER5 to TIMER4" range="8" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER7_CTRL" acronym="CFG0_TIMER7_CTRL" offset="0x421C" width="32" description="">
		<bitfield id="TIMER7_CTRL_CASCADE_EN" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER7 to TIMER6" range="8" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER9_CTRL" acronym="CFG0_TIMER9_CTRL" offset="0x4224" width="32" description="">
		<bitfield id="TIMER9_CTRL_CASCADE_EN" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER9 to TIMER8" range="8" rwaccess="R/W"/>
	</register>
