IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_TIMER11_CTRL" acronym="CFG0_TIMER11_CTRL" offset="0x422C" width="32" description="">
		<bitfield id="TIMER11_CTRL_CASCADE_EN" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER11 to TIMER10" range="8" rwaccess="R/W"/>
	</register>
	<register id="CFG0_I2C0_CTRL" acronym="CFG0_I2C0_CTRL" offset="0x42E0" width="32" description="">
		<bitfield id="I2C0_CTRL_HS_MCS_EN" width="1" begin="0" end="0" resetval="0x0" description="HS Mode controller current source activate." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_FSS_CTRL" acronym="CFG0_FSS_CTRL" offset="0x4700" width="32" description="">
		<bitfield id="FSS_CTRL_S0_BOOT_SIZE" width="1" begin="8" end="8" resetval="0x0" description="Selects the size of the boot block to be used for the S0 (OSPI0) flash interface" range="8" rwaccess="R/W"/> 
		<bitfield id="FSS_CTRL_S0_BOOT_SEG" width="6" begin="5" end="0" resetval="0x0" description="Selects the boot block to be used for the S0 (OSPI0) flash interface.  If the s0_boot_size is 128 MB then only bits [4:0] of this field are used.  Care must be taken to account for the address translation as to not fall off or wrap the address of the flash.  (e.g.  if both ECC and authentication are activated for 64 MB boot, the highest valid block number is is 49, as sector 50 is only .2M Bytes in size.)" range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ADC0_CTRL" acronym="CFG0_ADC0_CTRL" offset="0x4710" width="32" description="">
		<bitfield id="ADC0_CTRL_GPI_MODE_EN" width="1" begin="16" end="16" resetval="0x0" description="Activates ADC0 data pins to be used as general purpose inputs when set.  This signal is tied to the en_dig_test input of MCU_ADC0" range="16" rwaccess="R/W"/> 
		<bitfield id="ADC0_CTRL_TRIG_SEL" width="5" begin="4" end="0" resetval="0x0" description="Selects the source of the ADC hardware event trigger" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_DCC_STAT" acronym="CFG0_DCC_STAT" offset="0x4750" width="32" description="">
		<bitfield id="DCC_STAT_MCU_DCC0_INTR_DONE" width="1" begin="16" end="16" resetval="0x0" description="MCU_DCC0 Done Interrupt Status" range="16" rwaccess="R"/> 
		<bitfield id="DCC_STAT_DCC5_INTR_DONE" width="1" begin="5" end="5" resetval="0x0" description="DCC5 Done Interrupt Status" range="5" rwaccess="R"/> 
		<bitfield id="DCC_STAT_DCC4_INTR_DONE" width="1" begin="4" end="4" resetval="0x0" description="DCC4 Done Interrupt Status" range="4" rwaccess="R"/> 
		<bitfield id="DCC_STAT_DCC3_INTR_DONE" width="1" begin="3" end="3" resetval="0x0" description="DCC3 Done Interrupt Status" range="3" rwaccess="R"/> 
		<bitfield id="DCC_STAT_DCC2_INTR_DONE" width="1" begin="2" end="2" resetval="0x0" description="DCC2 Done Interrupt Status" range="2" rwaccess="R"/> 
		<bitfield id="DCC_STAT_DCC1_INTR_DONE" width="1" begin="1" end="1" resetval="0x0" description="DCC1 Done Interrupt Status" range="1" rwaccess="R"/> 
		<bitfield id="DCC_STAT_DCC0_INTR_DONE" width="1" begin="0" end="0" resetval="0x0" description="DCC0 Done Interrupt Status" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_LOCK1_KICK0" acronym="CFG0_LOCK1_KICK0" offset="0x5008" width="32" description="">
		<bitfield id="LOCK1_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK1_KICK1" acronym="CFG0_LOCK1_KICK1" offset="0x500C" width="32" description="">
		<bitfield id="LOCK1_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R0_READONLY" acronym="CFG0_CLAIMREG_P1_R0_READONLY" offset="0x5100" width="32" description="">
		<bitfield id="CLAIMREG_P1_R0_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R1_READONLY" acronym="CFG0_CLAIMREG_P1_R1_READONLY" offset="0x5104" width="32" description="">
		<bitfield id="CLAIMREG_P1_R1_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R2_READONLY" acronym="CFG0_CLAIMREG_P1_R2_READONLY" offset="0x5108" width="32" description="">
		<bitfield id="CLAIMREG_P1_R2_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R3_READONLY" acronym="CFG0_CLAIMREG_P1_R3_READONLY" offset="0x510C" width="32" description="">
		<bitfield id="CLAIMREG_P1_R3_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R4_READONLY" acronym="CFG0_CLAIMREG_P1_R4_READONLY" offset="0x5110" width="32" description="">
		<bitfield id="CLAIMREG_P1_R4_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R5_READONLY" acronym="CFG0_CLAIMREG_P1_R5_READONLY" offset="0x5114" width="32" description="">
		<bitfield id="CLAIMREG_P1_R5_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R6_READONLY" acronym="CFG0_CLAIMREG_P1_R6_READONLY" offset="0x5118" width="32" description="">
		<bitfield id="CLAIMREG_P1_R6_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R7_READONLY" acronym="CFG0_CLAIMREG_P1_R7_READONLY" offset="0x511C" width="32" description="">
		<bitfield id="CLAIMREG_P1_R7_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R8_READONLY" acronym="CFG0_CLAIMREG_P1_R8_READONLY" offset="0x5120" width="32" description="">
		<bitfield id="CLAIMREG_P1_R8_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R9_READONLY" acronym="CFG0_CLAIMREG_P1_R9_READONLY" offset="0x5124" width="32" description="">
		<bitfield id="CLAIMREG_P1_R9_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R10_READONLY" acronym="CFG0_CLAIMREG_P1_R10_READONLY" offset="0x5128" width="32" description="">
		<bitfield id="CLAIMREG_P1_R10_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
