IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_CLAIMREG_P1_R11_READONLY" acronym="CFG0_CLAIMREG_P1_R11_READONLY" offset="0x512C" width="32" description="">
		<bitfield id="CLAIMREG_P1_R11_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R12_READONLY" acronym="CFG0_CLAIMREG_P1_R12_READONLY" offset="0x5130" width="32" description="">
		<bitfield id="CLAIMREG_P1_R12_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R13_READONLY" acronym="CFG0_CLAIMREG_P1_R13_READONLY" offset="0x5134" width="32" description="">
		<bitfield id="CLAIMREG_P1_R13_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R14_READONLY" acronym="CFG0_CLAIMREG_P1_R14_READONLY" offset="0x5138" width="32" description="">
		<bitfield id="CLAIMREG_P1_R14_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_USB0_PHY_CTRL_PROXY" acronym="CFG0_USB0_PHY_CTRL_PROXY" offset="0x6008" width="32" description="">
		<bitfield id="USB0_PHY_CTRL_CORE_VOLTAGE_PROXY" width="1" begin="31" end="31" resetval="0x1" description="Selects the USB PHY Core Voltage" range="31" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_LOOPBACK_MODE_PROXY" width="2" begin="17" end="16" resetval="0x0" description="Activates USB0 PHY loopback operation" range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_STANDALONE_PROXY" width="1" begin="15" end="15" resetval="0x0" description="Activates USB0 PHY as a standalone PLL" range="15" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_CLKOUT_ON_PROXY" width="1" begin="11" end="11" resetval="0x0" description="Controls USB0 PLL clock output" range="11" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_CLKOUT_SEL_PROXY" width="2" begin="9" end="8" resetval="0x0" description="Selects the frequency of the USB0 PLL output clock" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="USB0_PHY_CTRL_PLL_REF_SEL_PROXY" width="4" begin="3" end="0" resetval="0x4" description="Indicates the frequency of the REF_CLOCK input used by the USB PLL.  This value should match the frequency value of either the HFOSC0 or HFOSC1 oscillator as selected by the USB0_CLKSEL register" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ENET1_CTRL_PROXY" acronym="CFG0_ENET1_CTRL_PROXY" offset="0x6044" width="32" description="">
		<bitfield id="ENET1_CTRL_RGMII_ID_MODE_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Port1 RGMII internal transmit delay selection" range="4" rwaccess="R/W"/> 
		<bitfield id="ENET1_CTRL_PORT_MODE_SEL_PROXY" width="3" begin="2" end="0" resetval="0x2" description="Selects Ethernet switch Port1 interface" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ENET2_CTRL_PROXY" acronym="CFG0_ENET2_CTRL_PROXY" offset="0x6048" width="32" description="">
		<bitfield id="ENET2_CTRL_RGMII_ID_MODE_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Port2 RGMII internal transmit delay selection" range="4" rwaccess="R/W"/> 
		<bitfield id="ENET2_CTRL_PORT_MODE_SEL_PROXY" width="3" begin="2" end="0" resetval="0x2" description="Selects Ethernet switch Port2 interface" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PCIE0_CTRL_PROXY" acronym="CFG0_PCIE0_CTRL_PROXY" offset="0x6070" width="32" description="">
		<bitfield id="PCIE0_CTRL_MODE_SEL_PROXY" width="1" begin="7" end="7" resetval="0x0" description="Selects the operating mode" range="7" rwaccess="R/W"/> 
		<bitfield id="PCIE0_CTRL_GENERATION_SEL_PROXY" width="2" begin="1" end="0" resetval="0x1" description="Configures  the PCIe generation support in the PCIe capabilities linked-list" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SERDES0_LN0_CTRL_PROXY" acronym="CFG0_SERDES0_LN0_CTRL_PROXY" offset="0x6080" width="32" description="">
		<bitfield id="SERDES0_LN0_CTRL_LANE_FUNC_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Selects the SERDES0 lane0 function" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ADC0_TRIM_PROXY" acronym="CFG0_ADC0_TRIM_PROXY" offset="0x60C0" width="32" description="">
		<bitfield id="ADC0_TRIM_TRIM5_PROXY" width="3" begin="26" end="24" resetval="0x0" description="Trims Nonlinearities from ADC" range="26 - 24" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM4_PROXY" width="3" begin="23" end="21" resetval="0x0" description="Trims Nonlinearities from ADC" range="23 - 21" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM3_PROXY" width="3" begin="20" end="18" resetval="0x0" description="Trims Nonlinearities from ADC" range="20 - 18" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM2_PROXY" width="4" begin="17" end="14" resetval="0x0" description="Trims Nonlinearities from ADC" range="17 - 14" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_TRIM1_PROXY" width="4" begin="13" end="10" resetval="0x0" description="Trims Nonlinearities from ADC" range="13 - 10" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_ENABLE_CALB_PROXY" width="5" begin="9" end="5" resetval="0x0" description="Trims Nonlinearities from ADC" range="9 - 5" rwaccess="R/W"/> 
		<bitfield id="ADC0_TRIM_ENABLE_CAL_PROXY" width="5" begin="4" end="0" resetval="0x0" description="Trims Nonlinearities from ADC" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SERDES0_CTRL_PROXY" acronym="CFG0_SERDES0_CTRL_PROXY" offset="0x60E0" width="32" description="">
		<bitfield id="SERDES0_CTRL_REF_SEL_PROXY" width="1" begin="12" end="12" resetval="0x0" description="REFCLK output select" range="12" rwaccess="R/W"/> 
		<bitfield id="SERDES0_CTRL_RET_EN_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Retention activate" range="8" rwaccess="R/W"/>
	</register>
