IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_ICSSG0_CTRL0_PROXY" acronym="CFG0_ICSSG0_CTRL0_PROXY" offset="0x6100" width="32" description="">
		<bitfield id="ICSSG0_CTRL0_RGMII0_ID_MODE_PROXY" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G0 RGMII0 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG0_CTRL0_GPM_BIDI_PROXY" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G0 PRU0_GPO pins.  Each bit n controls the corresponding PRG0_PRU0GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG0_CTRL1_PROXY" acronym="CFG0_ICSSG0_CTRL1_PROXY" offset="0x6104" width="32" description="">
		<bitfield id="ICSSG0_CTRL1_RGMII1_ID_MODE_PROXY" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G0 RGMII1 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG0_CTRL1_GPM_BIDI_PROXY" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G0 PRU1_GPO pins.  Each bit n controls the corresponding PRG0_PRU1GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG1_CTRL0_PROXY" acronym="CFG0_ICSSG1_CTRL0_PROXY" offset="0x6110" width="32" description="">
		<bitfield id="ICSSG1_CTRL0_RGMII0_ID_MODE_PROXY" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G1 RGMII0 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG1_CTRL0_GPM_BIDI_PROXY" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G1 PRU0_GPO pins.  Each bit n controls the corresponding PRG1_PRU0GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG1_CTRL1_PROXY" acronym="CFG0_ICSSG1_CTRL1_PROXY" offset="0x6114" width="32" description="">
		<bitfield id="ICSSG1_CTRL1_RGMII1_ID_MODE_PROXY" width="1" begin="24" end="24" resetval="0x0" description="Controls the ICSS_G1 RGMII1 port internal transmit delay" range="24" rwaccess="R/W"/> 
		<bitfield id="ICSSG1_CTRL1_GPM_BIDI_PROXY" width="20" begin="19" end="0" resetval="0x0" description="Controls operation of the ICSS_G1 PRU1_GPO pins.  Each bit n controls the corresponding PRG1_PRU1GPOn I/O" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM_TB_CLKEN_PROXY" acronym="CFG0_EPWM_TB_CLKEN_PROXY" offset="0x6130" width="32" description="">
		<bitfield id="EPWM_TB_CLKEN_EPWM8_TB_CLKEN_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Activates Timebase Clock of EPWM8 When Set" range="8" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM7_TB_CLKEN_PROXY" width="1" begin="7" end="7" resetval="0x0" description="Activates Timebase Clock of EPWM7 When Set" range="7" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM6_TB_CLKEN_PROXY" width="1" begin="6" end="6" resetval="0x0" description="Activates Timebase Clock of EPWM6 When Set" range="6" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM5_TB_CLKEN_PROXY" width="1" begin="5" end="5" resetval="0x0" description="Activates Timebase Clock of EPWM5 When Set" range="5" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM4_TB_CLKEN_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activates Timebase Clock of EPWM4 When Set" range="4" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM3_TB_CLKEN_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Activates Timebase Clock of EPWM3 When Set" range="3" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM2_TB_CLKEN_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Activates Timebase Clock of EPWM2 When Set" range="2" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM1_TB_CLKEN_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Activates Timebase Clock of EPWM1 When Set" range="1" rwaccess="R/W"/> 
		<bitfield id="EPWM_TB_CLKEN_EPWM0_TB_CLKEN_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Activates Timebase Clock of EPWM0 When Set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM_TB_CLKEN_SET_PROXY" acronym="CFG0_EPWM_TB_CLKEN_SET_PROXY" offset="0x6134" width="32" description="">
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM8_TB_CLKEN_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM8" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM7_TB_CLKEN_PROXY" width="1" begin="7" end="7" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM7" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM6_TB_CLKEN_PROXY" width="1" begin="6" end="6" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM6" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM5_TB_CLKEN_PROXY" width="1" begin="5" end="5" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM5" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM4_TB_CLKEN_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM4" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM3_TB_CLKEN_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM3" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM2_TB_CLKEN_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM2" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM1_TB_CLKEN_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM1" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="EPWM_TB_CLKEN_SET_EPWM0_TB_CLKEN_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Writing One Activates Timebase Clock of EPWM0" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG0_EPWM_TB_CLKEN_CLR_PROXY" acronym="CFG0_EPWM_TB_CLKEN_CLR_PROXY" offset="0x6138" width="32" description="">
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM8_TB_CLKEN_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM8" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM7_TB_CLKEN_PROXY" width="1" begin="7" end="7" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM7" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM6_TB_CLKEN_PROXY" width="1" begin="6" end="6" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM6" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM5_TB_CLKEN_PROXY" width="1" begin="5" end="5" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM5" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM4_TB_CLKEN_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM4" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM3_TB_CLKEN_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM3" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM2_TB_CLKEN_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM2" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM1_TB_CLKEN_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM1" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="EPWM_TB_CLKEN_CLR_EPWM0_TB_CLKEN_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Writing One Deactivates Timebase Clock of EPWM0" range="0" rwaccess="R/W1TC"/>
	</register>
