IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_EPWM0_CTRL_PROXY" acronym="CFG0_EPWM0_CTRL_PROXY" offset="0x6140" width="32" description="">
		<bitfield id="EPWM0_CTRL_SYNCIN_SEL_PROXY" width="3" begin="10" end="8" resetval="0x0" description="Selects the source of the EPWM0 synchronization input" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="EPWM0_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM1_CTRL_PROXY" acronym="CFG0_EPWM1_CTRL_PROXY" offset="0x6144" width="32" description="">
		<bitfield id="EPWM1_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM2_CTRL_PROXY" acronym="CFG0_EPWM2_CTRL_PROXY" offset="0x6148" width="32" description="">
		<bitfield id="EPWM2_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM3_CTRL_PROXY" acronym="CFG0_EPWM3_CTRL_PROXY" offset="0x614C" width="32" description="">
		<bitfield id="EPWM3_CTRL_SYNCIN_SEL_PROXY" width="3" begin="10" end="8" resetval="0x0" description="Selects the source of the EPWM3 synchronization input" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="EPWM3_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM4_CTRL_PROXY" acronym="CFG0_EPWM4_CTRL_PROXY" offset="0x6150" width="32" description="">
		<bitfield id="EPWM4_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM5_CTRL_PROXY" acronym="CFG0_EPWM5_CTRL_PROXY" offset="0x6154" width="32" description="">
		<bitfield id="EPWM5_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM6_CTRL_PROXY" acronym="CFG0_EPWM6_CTRL_PROXY" offset="0x6158" width="32" description="">
		<bitfield id="EPWM6_CTRL_SYNCIN_SEL_PROXY" width="3" begin="10" end="8" resetval="0x0" description="Selects the source of the EPWM6 synchronization input" range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="EPWM6_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM7_CTRL_PROXY" acronym="CFG0_EPWM7_CTRL_PROXY" offset="0x615C" width="32" description="">
		<bitfield id="EPWM7_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EPWM8_CTRL_PROXY" acronym="CFG0_EPWM8_CTRL_PROXY" offset="0x6160" width="32" description="">
		<bitfield id="EPWM8_CTRL_EALLOW_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activate write access to EPWM tripzone registers" range="4" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SOCA_SEL_PROXY" acronym="CFG0_SOCA_SEL_PROXY" offset="0x6170" width="32" description="">
		<bitfield id="SOCA_SEL_SOCA_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Selects the SOC A output source" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SOCB_SEL_PROXY" acronym="CFG0_SOCB_SEL_PROXY" offset="0x6174" width="32" description="">
		<bitfield id="SOCB_SEL_SOCB_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Selects the SOC B output source" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP0_CTRL_PROXY" acronym="CFG0_EQEP0_CTRL_PROXY" offset="0x6180" width="32" description="">
		<bitfield id="EQEP0_CTRL_SOCA_SEL_PROXY" width="5" begin="4" end="0" resetval="0x0" description="Selects the source of SOCA input for EQEP0" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP1_CTRL_PROXY" acronym="CFG0_EQEP1_CTRL_PROXY" offset="0x6184" width="32" description="">
		<bitfield id="EQEP1_CTRL_SOCA_SEL_PROXY" width="5" begin="4" end="0" resetval="0x0" description="Selects the source of SOCA input for EQEP1" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP2_CTRL_PROXY" acronym="CFG0_EQEP2_CTRL_PROXY" offset="0x6188" width="32" description="">
		<bitfield id="EQEP2_CTRL_SOCA_SEL_PROXY" width="5" begin="4" end="0" resetval="0x0" description="Selects the source of SOCA input for EQEP2" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EQEP_STAT_PROXY" acronym="CFG0_EQEP_STAT_PROXY" offset="0x61A0" width="32" description="">
		<bitfield id="EQEP_STAT_PHASE_ERR2_PROXY" width="1" begin="2" end="2" resetval="0x0" description="EQEP2 Phase error status" range="2" rwaccess="R"/> 
		<bitfield id="EQEP_STAT_PHASE_ERR1_PROXY" width="1" begin="1" end="1" resetval="0x0" description="EQEP1 Phase error status" range="1" rwaccess="R"/> 
		<bitfield id="EQEP_STAT_PHASE_ERR0_PROXY" width="1" begin="0" end="0" resetval="0x0" description="EQEP0 Phase error status" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_SDIO1_CTRL_PROXY" acronym="CFG0_SDIO1_CTRL_PROXY" offset="0x61B4" width="32" description="">
		<bitfield id="SDIO1_CTRL_DRV_STR_PROXY" width="5" begin="4" end="0" resetval="0x0" description="Selects the SDIO drive strength" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER1_CTRL_PROXY" acronym="CFG0_TIMER1_CTRL_PROXY" offset="0x6204" width="32" description="">
		<bitfield id="TIMER1_CTRL_CASCADE_EN_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER1 to TIMER0" range="8" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER3_CTRL_PROXY" acronym="CFG0_TIMER3_CTRL_PROXY" offset="0x620C" width="32" description="">
		<bitfield id="TIMER3_CTRL_CASCADE_EN_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Activates cascading of TIMER3 to TIMER2" range="8" rwaccess="R/W"/>
	</register>
