IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_CLAIMREG_P1_R11" acronym="CFG0_CLAIMREG_P1_R11" offset="0x712C" width="32" description="">
		<bitfield id="CLAIMREG_P1_R11" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R12" acronym="CFG0_CLAIMREG_P1_R12" offset="0x7130" width="32" description="">
		<bitfield id="CLAIMREG_P1_R12" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R13" acronym="CFG0_CLAIMREG_P1_R13" offset="0x7134" width="32" description="">
		<bitfield id="CLAIMREG_P1_R13" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P1_R14" acronym="CFG0_CLAIMREG_P1_R14" offset="0x7138" width="32" description="">
		<bitfield id="CLAIMREG_P1_R14" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 1" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_OBSCLK0_CTRL" acronym="CFG0_OBSCLK0_CTRL" offset="0x8000" width="32" description="">
		<bitfield id="OBSCLK0_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="OBSCLK0_CTRL_CLK_DIV" width="8" begin="15" end="8" resetval="0x0" description="OBSCLK0 output divider" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="OBSCLK0_CTRL_CLK_SEL" width="4" begin="3" end="0" resetval="0x7" description="OBSCLK0 clock source selection." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLKOUT_CTRL" acronym="CFG0_CLKOUT_CTRL" offset="0x8010" width="32" description="">
		<bitfield id="CLKOUT_CTRL_CLK_EN" width="1" begin="4" end="4" resetval="0x0" description="When set, activates CLKOUT output" range="4" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_CTRL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects CLKOUT clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_GTC_CLKSEL" acronym="CFG0_GTC_CLKSEL" offset="0x8030" width="32" description="">
		<bitfield id="GTC_CLKSEL_CLK_SEL" width="3" begin="2" end="0" resetval="0x0" description="Selects the GTC timebase clock source" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EFUSE_CLKSEL" acronym="CFG0_EFUSE_CLKSEL" offset="0x803C" width="32" description="">
		<bitfield id="EFUSE_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG0_CLKSEL" acronym="CFG0_ICSSG0_CLKSEL" offset="0x8040" width="32" description="">
		<bitfield id="ICSSG0_CLKSEL_IEP_CLKSEL" width="3" begin="18" end="16" resetval="0x0" description="Selects the ICSSG0 IEP clock source" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="ICSSG0_CLKSEL_CORE_CLKSEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the ICSSG0 functional clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG1_CLKSEL" acronym="CFG0_ICSSG1_CLKSEL" offset="0x8044" width="32" description="">
		<bitfield id="ICSSG1_CLKSEL_IEP_CLKSEL" width="3" begin="18" end="16" resetval="0x0" description="Selects the ICSSG1 IEP clock source" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="ICSSG1_CLKSEL_CORE_CLKSEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the ICSSG1 functional clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL0_CLKSEL" acronym="CFG0_MAIN_PLL0_CLKSEL" offset="0x8060" width="32" description="">
		<bitfield id="MAIN_PLL0_CLKSEL_BYPASS_SW_OVRD" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL0_CLKSEL_BYP_WARM_RST" width="1" begin="23" end="23" resetval="0x0" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL1_CLKSEL" acronym="CFG0_MAIN_PLL1_CLKSEL" offset="0x8064" width="32" description="">
		<bitfield id="MAIN_PLL1_CLKSEL_BYPASS_SW_OVRD" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL1_CLKSEL_BYP_WARM_RST" width="1" begin="23" end="23" resetval="0x0" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL2_CLKSEL" acronym="CFG0_MAIN_PLL2_CLKSEL" offset="0x8068" width="32" description="">
		<bitfield id="MAIN_PLL2_CLKSEL_BYPASS_SW_OVRD" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL2_CLKSEL_BYP_WARM_RST" width="1" begin="23" end="23" resetval="0x0" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL8_CLKSEL" acronym="CFG0_MAIN_PLL8_CLKSEL" offset="0x8080" width="32" description="">
		<bitfield id="MAIN_PLL8_CLKSEL_BYPASS_SW_OVRD" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL8_CLKSEL_BYP_WARM_RST" width="1" begin="23" end="23" resetval="0x1" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL12_CLKSEL" acronym="CFG0_MAIN_PLL12_CLKSEL" offset="0x8090" width="32" description="">
		<bitfield id="MAIN_PLL12_CLKSEL_BYPASS_SW_OVRD" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL12_CLKSEL_BYP_WARM_RST" width="1" begin="23" end="23" resetval="0x1" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL14_CLKSEL" acronym="CFG0_MAIN_PLL14_CLKSEL" offset="0x8098" width="32" description="">
		<bitfield id="MAIN_PLL14_CLKSEL_BYPASS_SW_OVRD" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL14_CLKSEL_BYP_WARM_RST" width="1" begin="23" end="23" resetval="0x1" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
