IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_PCIE0_CLKSEL" acronym="CFG0_PCIE0_CLKSEL" offset="0x8120" width="32" description="">
		<bitfield id="PCIE0_CLKSEL_CPTS_CLKSEL" width="3" begin="2" end="0" resetval="0x0" description="Selects the clock source for the PCIE0 Common Platform Time Stamp module" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CPSW_CLKSEL" acronym="CFG0_CPSW_CLKSEL" offset="0x8140" width="32" description="">
		<bitfield id="CPSW_CLKSEL_CPTS_CLKSEL" width="4" begin="3" end="0" resetval="0x0" description="Selects the clock source for the CPSW Ethernet switch Common Platform Time Stamp module" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CPTS_CLKSEL" acronym="CFG0_CPTS_CLKSEL" offset="0x8150" width="32" description="">
		<bitfield id="CPTS_CLKSEL_CPTS_CLKSEL" width="3" begin="2" end="0" resetval="0x0" description="Selects the clock source for the SoC Common Platform Time Stamp module" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EMMC0_CLKSEL" acronym="CFG0_EMMC0_CLKSEL" offset="0x8160" width="32" description="">
		<bitfield id="EMMC0_CLKSEL_EMMCSD0_REFCLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="eMMC XIN_CLK selection" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EMMC1_CLKSEL" acronym="CFG0_EMMC1_CLKSEL" offset="0x8168" width="32" description="">
		<bitfield id="EMMC1_CLKSEL_EMMCSD1_IO_CLKLB_SEL" width="1" begin="16" end="16" resetval="0x0" description="eMMC IO Clock Selection:" range="16" rwaccess="R/W"/> 
		<bitfield id="EMMC1_CLKSEL_EMMCSD1_REFCLK_SEL" width="1" begin="0" end="0" resetval="0x1" description="eMMC XIN_CLK selection" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_GPMC_CLKSEL" acronym="CFG0_GPMC_CLKSEL" offset="0x8180" width="32" description="">
		<bitfield id="GPMC_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the GPMC clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USB0_CLKSEL" acronym="CFG0_USB0_CLKSEL" offset="0x8190" width="32" description="">
		<bitfield id="USB0_CLKSEL_REFCLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for the USB0 ref_clk." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER0_CLKSEL" acronym="CFG0_TIMER0_CLKSEL" offset="0x81B0" width="32" description="">
		<bitfield id="TIMER0_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER1_CLKSEL" acronym="CFG0_TIMER1_CLKSEL" offset="0x81B4" width="32" description="">
		<bitfield id="TIMER1_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER2_CLKSEL" acronym="CFG0_TIMER2_CLKSEL" offset="0x81B8" width="32" description="">
		<bitfield id="TIMER2_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER3_CLKSEL" acronym="CFG0_TIMER3_CLKSEL" offset="0x81BC" width="32" description="">
		<bitfield id="TIMER3_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER4_CLKSEL" acronym="CFG0_TIMER4_CLKSEL" offset="0x81C0" width="32" description="">
		<bitfield id="TIMER4_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER5_CLKSEL" acronym="CFG0_TIMER5_CLKSEL" offset="0x81C4" width="32" description="">
		<bitfield id="TIMER5_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER6_CLKSEL" acronym="CFG0_TIMER6_CLKSEL" offset="0x81C8" width="32" description="">
		<bitfield id="TIMER6_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER7_CLKSEL" acronym="CFG0_TIMER7_CLKSEL" offset="0x81CC" width="32" description="">
		<bitfield id="TIMER7_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER8_CLKSEL" acronym="CFG0_TIMER8_CLKSEL" offset="0x81D0" width="32" description="">
		<bitfield id="TIMER8_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER9_CLKSEL" acronym="CFG0_TIMER9_CLKSEL" offset="0x81D4" width="32" description="">
		<bitfield id="TIMER9_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER10_CLKSEL" acronym="CFG0_TIMER10_CLKSEL" offset="0x81D8" width="32" description="">
		<bitfield id="TIMER10_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER11_CLKSEL" acronym="CFG0_TIMER11_CLKSEL" offset="0x81DC" width="32" description="">
		<bitfield id="TIMER11_CLKSEL_CLK_SEL" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI0_CLKSEL" acronym="CFG0_SPI0_CLKSEL" offset="0x8200" width="32" description="">
		<bitfield id="SPI0_CLKSEL_MSTR_LB_CLKSEL" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
