IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_SPI1_CLKSEL" acronym="CFG0_SPI1_CLKSEL" offset="0x8204" width="32" description="">
		<bitfield id="SPI1_CLKSEL_MSTR_LB_CLKSEL" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI2_CLKSEL" acronym="CFG0_SPI2_CLKSEL" offset="0x8208" width="32" description="">
		<bitfield id="SPI2_CLKSEL_MSTR_LB_CLKSEL" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI3_CLKSEL" acronym="CFG0_SPI3_CLKSEL" offset="0x820C" width="32" description="">
		<bitfield id="SPI3_CLKSEL_MSTR_LB_CLKSEL" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI4_CLKSEL" acronym="CFG0_SPI4_CLKSEL" offset="0x8210" width="32" description="">
		<bitfield id="SPI4_CLKSEL_MSTR_LB_CLKSEL" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART0_CLK_CTRL" acronym="CFG0_USART0_CLK_CTRL" offset="0x8240" width="32" description="">
		<bitfield id="USART0_CLK_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART0_CLK_CTRL_CLK_DIV" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART1_CLK_CTRL" acronym="CFG0_USART1_CLK_CTRL" offset="0x8244" width="32" description="">
		<bitfield id="USART1_CLK_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART1_CLK_CTRL_CLK_DIV" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART2_CLK_CTRL" acronym="CFG0_USART2_CLK_CTRL" offset="0x8248" width="32" description="">
		<bitfield id="USART2_CLK_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART2_CLK_CTRL_CLK_DIV" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART3_CLK_CTRL" acronym="CFG0_USART3_CLK_CTRL" offset="0x824C" width="32" description="">
		<bitfield id="USART3_CLK_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART3_CLK_CTRL_CLK_DIV" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART4_CLK_CTRL" acronym="CFG0_USART4_CLK_CTRL" offset="0x8250" width="32" description="">
		<bitfield id="USART4_CLK_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART4_CLK_CTRL_CLK_DIV" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART5_CLK_CTRL" acronym="CFG0_USART5_CLK_CTRL" offset="0x8254" width="32" description="">
		<bitfield id="USART5_CLK_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART5_CLK_CTRL_CLK_DIV" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART6_CLK_CTRL" acronym="CFG0_USART6_CLK_CTRL" offset="0x8258" width="32" description="">
		<bitfield id="USART6_CLK_CTRL_CLK_DIV_LD" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART6_CLK_CTRL_CLK_DIV" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART0_CLKSEL" acronym="CFG0_USART0_CLKSEL" offset="0x8280" width="32" description="">
		<bitfield id="USART0_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART0:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART1_CLKSEL" acronym="CFG0_USART1_CLKSEL" offset="0x8284" width="32" description="">
		<bitfield id="USART1_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART1:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART2_CLKSEL" acronym="CFG0_USART2_CLKSEL" offset="0x8288" width="32" description="">
		<bitfield id="USART2_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART2:" range="0" rwaccess="R/W"/>
	</register>
