IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_USART3_CLKSEL" acronym="CFG0_USART3_CLKSEL" offset="0x828C" width="32" description="">
		<bitfield id="USART3_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART3:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART4_CLKSEL" acronym="CFG0_USART4_CLKSEL" offset="0x8290" width="32" description="">
		<bitfield id="USART4_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART4:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART5_CLKSEL" acronym="CFG0_USART5_CLKSEL" offset="0x8294" width="32" description="">
		<bitfield id="USART5_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART5:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART6_CLKSEL" acronym="CFG0_USART6_CLKSEL" offset="0x8298" width="32" description="">
		<bitfield id="USART6_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART6:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD0_CLKSEL" acronym="CFG0_WWD0_CLKSEL" offset="0x8380" width="32" description="">
		<bitfield id="WWD0_CLKSEL_WRTLOCK" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD0_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD0_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD1_CLKSEL" acronym="CFG0_WWD1_CLKSEL" offset="0x8384" width="32" description="">
		<bitfield id="WWD1_CLKSEL_WRTLOCK" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD1_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD1_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD8_CLKSEL" acronym="CFG0_WWD8_CLKSEL" offset="0x83A0" width="32" description="">
		<bitfield id="WWD8_CLKSEL_WRTLOCK" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD8_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD8_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD9_CLKSEL" acronym="CFG0_WWD9_CLKSEL" offset="0x83A4" width="32" description="">
		<bitfield id="WWD9_CLKSEL_WRTLOCK" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD9_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD9_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD10_CLKSEL" acronym="CFG0_WWD10_CLKSEL" offset="0x83A8" width="32" description="">
		<bitfield id="WWD10_CLKSEL_WRTLOCK" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD10_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD10_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD11_CLKSEL" acronym="CFG0_WWD11_CLKSEL" offset="0x83AC" width="32" description="">
		<bitfield id="WWD11_CLKSEL_WRTLOCK" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD11_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD11_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SERDES0_CLKSEL" acronym="CFG0_SERDES0_CLKSEL" offset="0x8400" width="32" description="">
		<bitfield id="SERDES0_CLKSEL_CORE_REFCLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Selects the source for the core_refclk input" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MCAN0_CLKSEL" acronym="CFG0_MCAN0_CLKSEL" offset="0x8480" width="32" description="">
		<bitfield id="MCAN0_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="MAIN MCAN_CLK selection" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MCAN1_CLKSEL" acronym="CFG0_MCAN1_CLKSEL" offset="0x8484" width="32" description="">
		<bitfield id="MCAN1_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="MAIN MCAN_CLK selection" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_OSPI0_CLKSEL" acronym="CFG0_OSPI0_CLKSEL" offset="0x8500" width="32" description="">
		<bitfield id="OSPI0_CLKSEL_LOOPCLK_SEL" width="1" begin="4" end="4" resetval="0x0" description="OBSPI0 Loopback clock source" range="4" rwaccess="R/W"/> 
		<bitfield id="OSPI0_CLKSEL_CLK_SEL" width="1" begin="0" end="0" resetval="0x0" description="OSPI0 reference clock selection" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ADC0_CLKSEL" acronym="CFG0_ADC0_CLKSEL" offset="0x8510" width="32" description="">
		<bitfield id="ADC0_CLKSEL_CLK_SEL" width="2" begin="1" end="0" resetval="0x0" description="Selects the sampling clock source for ADC0" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK2_KICK0" acronym="CFG0_LOCK2_KICK0" offset="0x9008" width="32" description="">
		<bitfield id="LOCK2_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK2_KICK1" acronym="CFG0_LOCK2_KICK1" offset="0x900C" width="32" description="">
		<bitfield id="LOCK2_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R0_READONLY" acronym="CFG0_CLAIMREG_P2_R0_READONLY" offset="0x9100" width="32" description="">
		<bitfield id="CLAIMREG_P2_R0_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R1_READONLY" acronym="CFG0_CLAIMREG_P2_R1_READONLY" offset="0x9104" width="32" description="">
		<bitfield id="CLAIMREG_P2_R1_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R2_READONLY" acronym="CFG0_CLAIMREG_P2_R2_READONLY" offset="0x9108" width="32" description="">
		<bitfield id="CLAIMREG_P2_R2_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R3_READONLY" acronym="CFG0_CLAIMREG_P2_R3_READONLY" offset="0x910C" width="32" description="">
		<bitfield id="CLAIMREG_P2_R3_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
