IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_CLAIMREG_P2_R4_READONLY" acronym="CFG0_CLAIMREG_P2_R4_READONLY" offset="0x9110" width="32" description="">
		<bitfield id="CLAIMREG_P2_R4_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R5_READONLY" acronym="CFG0_CLAIMREG_P2_R5_READONLY" offset="0x9114" width="32" description="">
		<bitfield id="CLAIMREG_P2_R5_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R6_READONLY" acronym="CFG0_CLAIMREG_P2_R6_READONLY" offset="0x9118" width="32" description="">
		<bitfield id="CLAIMREG_P2_R6_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R7_READONLY" acronym="CFG0_CLAIMREG_P2_R7_READONLY" offset="0x911C" width="32" description="">
		<bitfield id="CLAIMREG_P2_R7_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R8_READONLY" acronym="CFG0_CLAIMREG_P2_R8_READONLY" offset="0x9120" width="32" description="">
		<bitfield id="CLAIMREG_P2_R8_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R9_READONLY" acronym="CFG0_CLAIMREG_P2_R9_READONLY" offset="0x9124" width="32" description="">
		<bitfield id="CLAIMREG_P2_R9_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R10_READONLY" acronym="CFG0_CLAIMREG_P2_R10_READONLY" offset="0x9128" width="32" description="">
		<bitfield id="CLAIMREG_P2_R10_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_OBSCLK0_CTRL_PROXY" acronym="CFG0_OBSCLK0_CTRL_PROXY" offset="0xA000" width="32" description="">
		<bitfield id="OBSCLK0_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="OBSCLK0_CTRL_CLK_DIV_PROXY" width="8" begin="15" end="8" resetval="0x0" description="OBSCLK0 output divider" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="OBSCLK0_CTRL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x7" description="OBSCLK0 clock source selection." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLKOUT_CTRL_PROXY" acronym="CFG0_CLKOUT_CTRL_PROXY" offset="0xA010" width="32" description="">
		<bitfield id="CLKOUT_CTRL_CLK_EN_PROXY" width="1" begin="4" end="4" resetval="0x0" description="When set, activates CLKOUT output" range="4" rwaccess="R/W"/> 
		<bitfield id="CLKOUT_CTRL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects CLKOUT clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_GTC_CLKSEL_PROXY" acronym="CFG0_GTC_CLKSEL_PROXY" offset="0xA030" width="32" description="">
		<bitfield id="GTC_CLKSEL_CLK_SEL_PROXY" width="3" begin="2" end="0" resetval="0x0" description="Selects the GTC timebase clock source" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EFUSE_CLKSEL_PROXY" acronym="CFG0_EFUSE_CLKSEL_PROXY" offset="0xA03C" width="32" description="">
		<bitfield id="EFUSE_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG0_CLKSEL_PROXY" acronym="CFG0_ICSSG0_CLKSEL_PROXY" offset="0xA040" width="32" description="">
		<bitfield id="ICSSG0_CLKSEL_IEP_CLKSEL_PROXY" width="3" begin="18" end="16" resetval="0x0" description="Selects the ICSSG0 IEP clock source" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="ICSSG0_CLKSEL_CORE_CLKSEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the ICSSG0 functional clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ICSSG1_CLKSEL_PROXY" acronym="CFG0_ICSSG1_CLKSEL_PROXY" offset="0xA044" width="32" description="">
		<bitfield id="ICSSG1_CLKSEL_IEP_CLKSEL_PROXY" width="3" begin="18" end="16" resetval="0x0" description="Selects the ICSSG1 IEP clock source" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="ICSSG1_CLKSEL_CORE_CLKSEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the ICSSG1 functional clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL0_CLKSEL_PROXY" acronym="CFG0_MAIN_PLL0_CLKSEL_PROXY" offset="0xA060" width="32" description="">
		<bitfield id="MAIN_PLL0_CLKSEL_BYPASS_SW_OVRD_PROXY" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL0_CLKSEL_BYP_WARM_RST_PROXY" width="1" begin="23" end="23" resetval="0x0" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL1_CLKSEL_PROXY" acronym="CFG0_MAIN_PLL1_CLKSEL_PROXY" offset="0xA064" width="32" description="">
		<bitfield id="MAIN_PLL1_CLKSEL_BYPASS_SW_OVRD_PROXY" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL1_CLKSEL_BYP_WARM_RST_PROXY" width="1" begin="23" end="23" resetval="0x0" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL2_CLKSEL_PROXY" acronym="CFG0_MAIN_PLL2_CLKSEL_PROXY" offset="0xA068" width="32" description="">
		<bitfield id="MAIN_PLL2_CLKSEL_BYPASS_SW_OVRD_PROXY" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL2_CLKSEL_BYP_WARM_RST_PROXY" width="1" begin="23" end="23" resetval="0x0" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL8_CLKSEL_PROXY" acronym="CFG0_MAIN_PLL8_CLKSEL_PROXY" offset="0xA080" width="32" description="">
		<bitfield id="MAIN_PLL8_CLKSEL_BYPASS_SW_OVRD_PROXY" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL8_CLKSEL_BYP_WARM_RST_PROXY" width="1" begin="23" end="23" resetval="0x1" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL12_CLKSEL_PROXY" acronym="CFG0_MAIN_PLL12_CLKSEL_PROXY" offset="0xA090" width="32" description="">
		<bitfield id="MAIN_PLL12_CLKSEL_BYPASS_SW_OVRD_PROXY" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL12_CLKSEL_BYP_WARM_RST_PROXY" width="1" begin="23" end="23" resetval="0x1" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MAIN_PLL14_CLKSEL_PROXY" acronym="CFG0_MAIN_PLL14_CLKSEL_PROXY" offset="0xA098" width="32" description="">
		<bitfield id="MAIN_PLL14_CLKSEL_BYPASS_SW_OVRD_PROXY" width="1" begin="31" end="31" resetval="0x0" description="PLL Bypass warm reset software override" range="31" rwaccess="R/W"/> 
		<bitfield id="MAIN_PLL14_CLKSEL_BYP_WARM_RST_PROXY" width="1" begin="23" end="23" resetval="0x1" description="PLL bypass mode after warm reset." range="23" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PCIE0_CLKSEL_PROXY" acronym="CFG0_PCIE0_CLKSEL_PROXY" offset="0xA120" width="32" description="">
		<bitfield id="PCIE0_CLKSEL_CPTS_CLKSEL_PROXY" width="3" begin="2" end="0" resetval="0x0" description="Selects the clock source for the PCIE0 Common Platform Time Stamp module" range="2 - 0" rwaccess="R/W"/>
	</register>
