IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_CPSW_CLKSEL_PROXY" acronym="CFG0_CPSW_CLKSEL_PROXY" offset="0xA140" width="32" description="">
		<bitfield id="CPSW_CLKSEL_CPTS_CLKSEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Selects the clock source for the CPSW Ethernet switch Common Platform Time Stamp module" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CPTS_CLKSEL_PROXY" acronym="CFG0_CPTS_CLKSEL_PROXY" offset="0xA150" width="32" description="">
		<bitfield id="CPTS_CLKSEL_CPTS_CLKSEL_PROXY" width="3" begin="2" end="0" resetval="0x0" description="Selects the clock source for the SoC Common Platform Time Stamp module" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EMMC0_CLKSEL_PROXY" acronym="CFG0_EMMC0_CLKSEL_PROXY" offset="0xA160" width="32" description="">
		<bitfield id="EMMC0_CLKSEL_EMMCSD0_REFCLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="eMMC XIN_CLK selection" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_EMMC1_CLKSEL_PROXY" acronym="CFG0_EMMC1_CLKSEL_PROXY" offset="0xA168" width="32" description="">
		<bitfield id="EMMC1_CLKSEL_EMMCSD1_IO_CLKLB_SEL_PROXY" width="1" begin="16" end="16" resetval="0x0" description="eMMC IO Clock Selection:" range="16" rwaccess="R/W"/> 
		<bitfield id="EMMC1_CLKSEL_EMMCSD1_REFCLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x1" description="eMMC XIN_CLK selection" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_GPMC_CLKSEL_PROXY" acronym="CFG0_GPMC_CLKSEL_PROXY" offset="0xA180" width="32" description="">
		<bitfield id="GPMC_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the GPMC clock source" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USB0_CLKSEL_PROXY" acronym="CFG0_USB0_CLKSEL_PROXY" offset="0xA190" width="32" description="">
		<bitfield id="USB0_CLKSEL_REFCLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for the USB0 ref_clk." range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER0_CLKSEL_PROXY" acronym="CFG0_TIMER0_CLKSEL_PROXY" offset="0xA1B0" width="32" description="">
		<bitfield id="TIMER0_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER1_CLKSEL_PROXY" acronym="CFG0_TIMER1_CLKSEL_PROXY" offset="0xA1B4" width="32" description="">
		<bitfield id="TIMER1_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER2_CLKSEL_PROXY" acronym="CFG0_TIMER2_CLKSEL_PROXY" offset="0xA1B8" width="32" description="">
		<bitfield id="TIMER2_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER3_CLKSEL_PROXY" acronym="CFG0_TIMER3_CLKSEL_PROXY" offset="0xA1BC" width="32" description="">
		<bitfield id="TIMER3_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER4_CLKSEL_PROXY" acronym="CFG0_TIMER4_CLKSEL_PROXY" offset="0xA1C0" width="32" description="">
		<bitfield id="TIMER4_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER5_CLKSEL_PROXY" acronym="CFG0_TIMER5_CLKSEL_PROXY" offset="0xA1C4" width="32" description="">
		<bitfield id="TIMER5_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER6_CLKSEL_PROXY" acronym="CFG0_TIMER6_CLKSEL_PROXY" offset="0xA1C8" width="32" description="">
		<bitfield id="TIMER6_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER7_CLKSEL_PROXY" acronym="CFG0_TIMER7_CLKSEL_PROXY" offset="0xA1CC" width="32" description="">
		<bitfield id="TIMER7_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER8_CLKSEL_PROXY" acronym="CFG0_TIMER8_CLKSEL_PROXY" offset="0xA1D0" width="32" description="">
		<bitfield id="TIMER8_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER9_CLKSEL_PROXY" acronym="CFG0_TIMER9_CLKSEL_PROXY" offset="0xA1D4" width="32" description="">
		<bitfield id="TIMER9_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER10_CLKSEL_PROXY" acronym="CFG0_TIMER10_CLKSEL_PROXY" offset="0xA1D8" width="32" description="">
		<bitfield id="TIMER10_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_TIMER11_CLKSEL_PROXY" acronym="CFG0_TIMER11_CLKSEL_PROXY" offset="0xA1DC" width="32" description="">
		<bitfield id="TIMER11_CLKSEL_CLK_SEL_PROXY" width="4" begin="3" end="0" resetval="0x0" description="Timer functional clock input select mux control (Reserved values default to HFOSC1_CLK)" range="3 - 0" rwaccess="R/W"/>
	</register>
