IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_SPI0_CLKSEL_PROXY" acronym="CFG0_SPI0_CLKSEL_PROXY" offset="0xA200" width="32" description="">
		<bitfield id="SPI0_CLKSEL_MSTR_LB_CLKSEL_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI1_CLKSEL_PROXY" acronym="CFG0_SPI1_CLKSEL_PROXY" offset="0xA204" width="32" description="">
		<bitfield id="SPI1_CLKSEL_MSTR_LB_CLKSEL_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI2_CLKSEL_PROXY" acronym="CFG0_SPI2_CLKSEL_PROXY" offset="0xA208" width="32" description="">
		<bitfield id="SPI2_CLKSEL_MSTR_LB_CLKSEL_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI3_CLKSEL_PROXY" acronym="CFG0_SPI3_CLKSEL_PROXY" offset="0xA20C" width="32" description="">
		<bitfield id="SPI3_CLKSEL_MSTR_LB_CLKSEL_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SPI4_CLKSEL_PROXY" acronym="CFG0_SPI4_CLKSEL_PROXY" offset="0xA210" width="32" description="">
		<bitfield id="SPI4_CLKSEL_MSTR_LB_CLKSEL_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Controller mode receive capture clock loopback selection" range="16" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART0_CLK_CTRL_PROXY" acronym="CFG0_USART0_CLK_CTRL_PROXY" offset="0xA240" width="32" description="">
		<bitfield id="USART0_CLK_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART0_CLK_CTRL_CLK_DIV_PROXY" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART1_CLK_CTRL_PROXY" acronym="CFG0_USART1_CLK_CTRL_PROXY" offset="0xA244" width="32" description="">
		<bitfield id="USART1_CLK_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART1_CLK_CTRL_CLK_DIV_PROXY" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART2_CLK_CTRL_PROXY" acronym="CFG0_USART2_CLK_CTRL_PROXY" offset="0xA248" width="32" description="">
		<bitfield id="USART2_CLK_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART2_CLK_CTRL_CLK_DIV_PROXY" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART3_CLK_CTRL_PROXY" acronym="CFG0_USART3_CLK_CTRL_PROXY" offset="0xA24C" width="32" description="">
		<bitfield id="USART3_CLK_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART3_CLK_CTRL_CLK_DIV_PROXY" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART4_CLK_CTRL_PROXY" acronym="CFG0_USART4_CLK_CTRL_PROXY" offset="0xA250" width="32" description="">
		<bitfield id="USART4_CLK_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART4_CLK_CTRL_CLK_DIV_PROXY" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART5_CLK_CTRL_PROXY" acronym="CFG0_USART5_CLK_CTRL_PROXY" offset="0xA254" width="32" description="">
		<bitfield id="USART5_CLK_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART5_CLK_CTRL_CLK_DIV_PROXY" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART6_CLK_CTRL_PROXY" acronym="CFG0_USART6_CLK_CTRL_PROXY" offset="0xA258" width="32" description="">
		<bitfield id="USART6_CLK_CTRL_CLK_DIV_LD_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Load the output divider value" range="16" rwaccess="R/W"/> 
		<bitfield id="USART6_CLK_CTRL_CLK_DIV_PROXY" width="2" begin="1" end="0" resetval="0x3" description="Selects the clock divider value. Supports divide values of 1 to 4  Default is /4.  To load the new divider value the clk_div_ld bit must be cleared and then set to 1." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART0_CLKSEL_PROXY" acronym="CFG0_USART0_CLKSEL_PROXY" offset="0xA280" width="32" description="">
		<bitfield id="USART0_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART0:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART1_CLKSEL_PROXY" acronym="CFG0_USART1_CLKSEL_PROXY" offset="0xA284" width="32" description="">
		<bitfield id="USART1_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART1:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART2_CLKSEL_PROXY" acronym="CFG0_USART2_CLKSEL_PROXY" offset="0xA288" width="32" description="">
		<bitfield id="USART2_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART2:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART3_CLKSEL_PROXY" acronym="CFG0_USART3_CLKSEL_PROXY" offset="0xA28C" width="32" description="">
		<bitfield id="USART3_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART3:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART4_CLKSEL_PROXY" acronym="CFG0_USART4_CLKSEL_PROXY" offset="0xA290" width="32" description="">
		<bitfield id="USART4_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART4:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART5_CLKSEL_PROXY" acronym="CFG0_USART5_CLKSEL_PROXY" offset="0xA294" width="32" description="">
		<bitfield id="USART5_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART5:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_USART6_CLKSEL_PROXY" acronym="CFG0_USART6_CLKSEL_PROXY" offset="0xA298" width="32" description="">
		<bitfield id="USART6_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Selects the clock source for UART6:" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD0_CLKSEL_PROXY" acronym="CFG0_WWD0_CLKSEL_PROXY" offset="0xA380" width="32" description="">
		<bitfield id="WWD0_CLKSEL_WRTLOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD0_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD0_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD1_CLKSEL_PROXY" acronym="CFG0_WWD1_CLKSEL_PROXY" offset="0xA384" width="32" description="">
		<bitfield id="WWD1_CLKSEL_WRTLOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD1_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD1_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD8_CLKSEL_PROXY" acronym="CFG0_WWD8_CLKSEL_PROXY" offset="0xA3A0" width="32" description="">
		<bitfield id="WWD8_CLKSEL_WRTLOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD8_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD8_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD9_CLKSEL_PROXY" acronym="CFG0_WWD9_CLKSEL_PROXY" offset="0xA3A4" width="32" description="">
		<bitfield id="WWD9_CLKSEL_WRTLOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD9_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD9_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_WWD10_CLKSEL_PROXY" acronym="CFG0_WWD10_CLKSEL_PROXY" offset="0xA3A8" width="32" description="">
		<bitfield id="WWD10_CLKSEL_WRTLOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD10_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD10_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
