IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_WWD11_CLKSEL_PROXY" acronym="CFG0_WWD11_CLKSEL_PROXY" offset="0xA3AC" width="32" description="">
		<bitfield id="WWD11_CLKSEL_WRTLOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="When set, locks WWD11_CLKSEL from further writes until the next module reset." range="31" rwaccess="R/W"/> 
		<bitfield id="WWD11_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Windowed watchdog timer functional clock input select mux control" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_SERDES0_CLKSEL_PROXY" acronym="CFG0_SERDES0_CLKSEL_PROXY" offset="0xA400" width="32" description="">
		<bitfield id="SERDES0_CLKSEL_CORE_REFCLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Selects the source for the core_refclk input" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MCAN0_CLKSEL_PROXY" acronym="CFG0_MCAN0_CLKSEL_PROXY" offset="0xA480" width="32" description="">
		<bitfield id="MCAN0_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="MAIN MCAN_CLK selection" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_MCAN1_CLKSEL_PROXY" acronym="CFG0_MCAN1_CLKSEL_PROXY" offset="0xA484" width="32" description="">
		<bitfield id="MCAN1_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="MAIN MCAN_CLK selection" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_OSPI0_CLKSEL_PROXY" acronym="CFG0_OSPI0_CLKSEL_PROXY" offset="0xA500" width="32" description="">
		<bitfield id="OSPI0_CLKSEL_LOOPCLK_SEL_PROXY" width="1" begin="4" end="4" resetval="0x0" description="OBSPI0 Loopback clock source" range="4" rwaccess="R/W"/> 
		<bitfield id="OSPI0_CLKSEL_CLK_SEL_PROXY" width="1" begin="0" end="0" resetval="0x0" description="OSPI0 reference clock selection" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_ADC0_CLKSEL_PROXY" acronym="CFG0_ADC0_CLKSEL_PROXY" offset="0xA510" width="32" description="">
		<bitfield id="ADC0_CLKSEL_CLK_SEL_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Selects the sampling clock source for ADC0" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK2_KICK0_PROXY" acronym="CFG0_LOCK2_KICK0_PROXY" offset="0xB008" width="32" description="">
		<bitfield id="LOCK2_KICK0_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK2_KICK1_PROXY" acronym="CFG0_LOCK2_KICK1_PROXY" offset="0xB00C" width="32" description="">
		<bitfield id="LOCK2_KICK1_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R0" acronym="CFG0_CLAIMREG_P2_R0" offset="0xB100" width="32" description="">
		<bitfield id="CLAIMREG_P2_R0" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R1" acronym="CFG0_CLAIMREG_P2_R1" offset="0xB104" width="32" description="">
		<bitfield id="CLAIMREG_P2_R1" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R2" acronym="CFG0_CLAIMREG_P2_R2" offset="0xB108" width="32" description="">
		<bitfield id="CLAIMREG_P2_R2" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R3" acronym="CFG0_CLAIMREG_P2_R3" offset="0xB10C" width="32" description="">
		<bitfield id="CLAIMREG_P2_R3" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R4" acronym="CFG0_CLAIMREG_P2_R4" offset="0xB110" width="32" description="">
		<bitfield id="CLAIMREG_P2_R4" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R5" acronym="CFG0_CLAIMREG_P2_R5" offset="0xB114" width="32" description="">
		<bitfield id="CLAIMREG_P2_R5" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R6" acronym="CFG0_CLAIMREG_P2_R6" offset="0xB118" width="32" description="">
		<bitfield id="CLAIMREG_P2_R6" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R7" acronym="CFG0_CLAIMREG_P2_R7" offset="0xB11C" width="32" description="">
		<bitfield id="CLAIMREG_P2_R7" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R8" acronym="CFG0_CLAIMREG_P2_R8" offset="0xB120" width="32" description="">
		<bitfield id="CLAIMREG_P2_R8" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R9" acronym="CFG0_CLAIMREG_P2_R9" offset="0xB124" width="32" description="">
		<bitfield id="CLAIMREG_P2_R9" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P2_R10" acronym="CFG0_CLAIMREG_P2_R10" offset="0xB128" width="32" description="">
		<bitfield id="CLAIMREG_P2_R10" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 2" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_FUSE_CRC_STAT" acronym="CFG0_FUSE_CRC_STAT" offset="0xC320" width="32" description="">
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_7" width="1" begin="7" end="7" resetval="0x0" description="Indicates eFuse CRC error on chain 7" range="7" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_6" width="1" begin="6" end="6" resetval="0x0" description="Indicates eFuse CRC error on chain 6" range="6" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_5" width="1" begin="5" end="5" resetval="0x0" description="Indicates eFuse CRC error on chain 5" range="5" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_4" width="1" begin="4" end="4" resetval="0x0" description="Indicates eFuse CRC error on chain 4" range="4" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_3" width="1" begin="3" end="3" resetval="0x0" description="Indicates eFuse CRC error on chain 3" range="3" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_2" width="1" begin="2" end="2" resetval="0x0" description="Indicates eFuse CRC error on chain 2" range="2" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_1" width="1" begin="1" end="1" resetval="0x0" description="Indicates eFuse CRC error on chain 1" range="1" rwaccess="R"/>
	</register>
	<register id="CFG0_PBIST_EN" acronym="CFG0_PBIST_EN" offset="0xC400" width="32" description="">
		<bitfield id="PBIST_EN_PCIE0" width="1" begin="8" end="8" resetval="0x0" description="Activates PBIST Access to PCIE0 Memories" range="8" rwaccess="R/W"/> 
		<bitfield id="PBIST_EN_USB0" width="1" begin="4" end="4" resetval="0x0" description="Activates PBIST Access to USB0 Memories" range="4" rwaccess="R/W"/> 
		<bitfield id="PBIST_EN_EMMC1" width="1" begin="1" end="1" resetval="0x0" description="Activates PBIST Access to MMC1 Memories" range="1" rwaccess="R/W"/> 
		<bitfield id="PBIST_EN_EMMC0" width="1" begin="0" end="0" resetval="0x0" description="Activates PBIST Access to MMC0 Memories" range="0" rwaccess="R/W"/>
	</register>
