IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_LOCK3_KICK0" acronym="CFG0_LOCK3_KICK0" offset="0xD008" width="32" description="">
		<bitfield id="LOCK3_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK3_KICK1" acronym="CFG0_LOCK3_KICK1" offset="0xD00C" width="32" description="">
		<bitfield id="LOCK3_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R0_READONLY" acronym="CFG0_CLAIMREG_P3_R0_READONLY" offset="0xD100" width="32" description="">
		<bitfield id="CLAIMREG_P3_R0_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R1_READONLY" acronym="CFG0_CLAIMREG_P3_R1_READONLY" offset="0xD104" width="32" description="">
		<bitfield id="CLAIMREG_P3_R1_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R2_READONLY" acronym="CFG0_CLAIMREG_P3_R2_READONLY" offset="0xD108" width="32" description="">
		<bitfield id="CLAIMREG_P3_R2_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R3_READONLY" acronym="CFG0_CLAIMREG_P3_R3_READONLY" offset="0xD10C" width="32" description="">
		<bitfield id="CLAIMREG_P3_R3_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R4_READONLY" acronym="CFG0_CLAIMREG_P3_R4_READONLY" offset="0xD110" width="32" description="">
		<bitfield id="CLAIMREG_P3_R4_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R5_READONLY" acronym="CFG0_CLAIMREG_P3_R5_READONLY" offset="0xD114" width="32" description="">
		<bitfield id="CLAIMREG_P3_R5_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R6_READONLY" acronym="CFG0_CLAIMREG_P3_R6_READONLY" offset="0xD118" width="32" description="">
		<bitfield id="CLAIMREG_P3_R6_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R7_READONLY" acronym="CFG0_CLAIMREG_P3_R7_READONLY" offset="0xD11C" width="32" description="">
		<bitfield id="CLAIMREG_P3_R7_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R8_READONLY" acronym="CFG0_CLAIMREG_P3_R8_READONLY" offset="0xD120" width="32" description="">
		<bitfield id="CLAIMREG_P3_R8_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_FUSE_CRC_STAT_PROXY" acronym="CFG0_FUSE_CRC_STAT_PROXY" offset="0xE320" width="32" description="">
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_7_PROXY" width="1" begin="7" end="7" resetval="0x0" description="Indicates eFuse CRC error on chain 7" range="7" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_6_PROXY" width="1" begin="6" end="6" resetval="0x0" description="Indicates eFuse CRC error on chain 6" range="6" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_5_PROXY" width="1" begin="5" end="5" resetval="0x0" description="Indicates eFuse CRC error on chain 5" range="5" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_4_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Indicates eFuse CRC error on chain 4" range="4" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_3_PROXY" width="1" begin="3" end="3" resetval="0x0" description="Indicates eFuse CRC error on chain 3" range="3" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_2_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Indicates eFuse CRC error on chain 2" range="2" rwaccess="R"/> 
		<bitfield id="FUSE_CRC_STAT_CRC_ERR_1_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Indicates eFuse CRC error on chain 1" range="1" rwaccess="R"/>
	</register>
	<register id="CFG0_PBIST_EN_PROXY" acronym="CFG0_PBIST_EN_PROXY" offset="0xE400" width="32" description="">
		<bitfield id="PBIST_EN_PCIE0_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Activates PBIST Access to PCIE0 Memories" range="8" rwaccess="R/W"/> 
		<bitfield id="PBIST_EN_USB0_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Activates PBIST Access to USB0 Memories" range="4" rwaccess="R/W"/> 
		<bitfield id="PBIST_EN_EMMC1_PROXY" width="1" begin="1" end="1" resetval="0x0" description="Activates PBIST Access to MMC1 Memories" range="1" rwaccess="R/W"/> 
		<bitfield id="PBIST_EN_EMMC0_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Activates PBIST Access to MMC0 Memories" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK3_KICK0_PROXY" acronym="CFG0_LOCK3_KICK0_PROXY" offset="0xF008" width="32" description="">
		<bitfield id="LOCK3_KICK0_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK3_KICK1_PROXY" acronym="CFG0_LOCK3_KICK1_PROXY" offset="0xF00C" width="32" description="">
		<bitfield id="LOCK3_KICK1_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R0" acronym="CFG0_CLAIMREG_P3_R0" offset="0xF100" width="32" description="">
		<bitfield id="CLAIMREG_P3_R0" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
