IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_CLAIMREG_P3_R1" acronym="CFG0_CLAIMREG_P3_R1" offset="0xF104" width="32" description="">
		<bitfield id="CLAIMREG_P3_R1" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R2" acronym="CFG0_CLAIMREG_P3_R2" offset="0xF108" width="32" description="">
		<bitfield id="CLAIMREG_P3_R2" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R3" acronym="CFG0_CLAIMREG_P3_R3" offset="0xF10C" width="32" description="">
		<bitfield id="CLAIMREG_P3_R3" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R4" acronym="CFG0_CLAIMREG_P3_R4" offset="0xF110" width="32" description="">
		<bitfield id="CLAIMREG_P3_R4" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R5" acronym="CFG0_CLAIMREG_P3_R5" offset="0xF114" width="32" description="">
		<bitfield id="CLAIMREG_P3_R5" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R6" acronym="CFG0_CLAIMREG_P3_R6" offset="0xF118" width="32" description="">
		<bitfield id="CLAIMREG_P3_R6" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R7" acronym="CFG0_CLAIMREG_P3_R7" offset="0xF11C" width="32" description="">
		<bitfield id="CLAIMREG_P3_R7" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P3_R8" acronym="CFG0_CLAIMREG_P3_R8" offset="0xF120" width="32" description="">
		<bitfield id="CLAIMREG_P3_R8" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 3" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK4_KICK0" acronym="CFG0_LOCK4_KICK0" offset="0x11008" width="32" description="">
		<bitfield id="LOCK4_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK4_KICK1" acronym="CFG0_LOCK4_KICK1" offset="0x1100C" width="32" description="">
		<bitfield id="LOCK4_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R0_READONLY" acronym="CFG0_CLAIMREG_P4_R0_READONLY" offset="0x11100" width="32" description="">
		<bitfield id="CLAIMREG_P4_R0_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R1_READONLY" acronym="CFG0_CLAIMREG_P4_R1_READONLY" offset="0x11104" width="32" description="">
		<bitfield id="CLAIMREG_P4_R1_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R2_READONLY" acronym="CFG0_CLAIMREG_P4_R2_READONLY" offset="0x11108" width="32" description="">
		<bitfield id="CLAIMREG_P4_R2_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R3_READONLY" acronym="CFG0_CLAIMREG_P4_R3_READONLY" offset="0x1110C" width="32" description="">
		<bitfield id="CLAIMREG_P4_R3_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R4_READONLY" acronym="CFG0_CLAIMREG_P4_R4_READONLY" offset="0x11110" width="32" description="">
		<bitfield id="CLAIMREG_P4_R4_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R5_READONLY" acronym="CFG0_CLAIMREG_P4_R5_READONLY" offset="0x11114" width="32" description="">
		<bitfield id="CLAIMREG_P4_R5_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R6_READONLY" acronym="CFG0_CLAIMREG_P4_R6_READONLY" offset="0x11118" width="32" description="">
		<bitfield id="CLAIMREG_P4_R6_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R7_READONLY" acronym="CFG0_CLAIMREG_P4_R7_READONLY" offset="0x1111C" width="32" description="">
		<bitfield id="CLAIMREG_P4_R7_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R8_READONLY" acronym="CFG0_CLAIMREG_P4_R8_READONLY" offset="0x11120" width="32" description="">
		<bitfield id="CLAIMREG_P4_R8_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R9_READONLY" acronym="CFG0_CLAIMREG_P4_R9_READONLY" offset="0x11124" width="32" description="">
		<bitfield id="CLAIMREG_P4_R9_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R10_READONLY" acronym="CFG0_CLAIMREG_P4_R10_READONLY" offset="0x11128" width="32" description="">
		<bitfield id="CLAIMREG_P4_R10_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R11_READONLY" acronym="CFG0_CLAIMREG_P4_R11_READONLY" offset="0x1112C" width="32" description="">
		<bitfield id="CLAIMREG_P4_R11_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R12_READONLY" acronym="CFG0_CLAIMREG_P4_R12_READONLY" offset="0x11130" width="32" description="">
		<bitfield id="CLAIMREG_P4_R12_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R"/>
	</register>
