IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_LOCK4_KICK0_PROXY" acronym="CFG0_LOCK4_KICK0_PROXY" offset="0x13008" width="32" description="">
		<bitfield id="LOCK4_KICK0_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK4_KICK1_PROXY" acronym="CFG0_LOCK4_KICK1_PROXY" offset="0x1300C" width="32" description="">
		<bitfield id="LOCK4_KICK1_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R0" acronym="CFG0_CLAIMREG_P4_R0" offset="0x13100" width="32" description="">
		<bitfield id="CLAIMREG_P4_R0" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R1" acronym="CFG0_CLAIMREG_P4_R1" offset="0x13104" width="32" description="">
		<bitfield id="CLAIMREG_P4_R1" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R2" acronym="CFG0_CLAIMREG_P4_R2" offset="0x13108" width="32" description="">
		<bitfield id="CLAIMREG_P4_R2" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R3" acronym="CFG0_CLAIMREG_P4_R3" offset="0x1310C" width="32" description="">
		<bitfield id="CLAIMREG_P4_R3" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R4" acronym="CFG0_CLAIMREG_P4_R4" offset="0x13110" width="32" description="">
		<bitfield id="CLAIMREG_P4_R4" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R5" acronym="CFG0_CLAIMREG_P4_R5" offset="0x13114" width="32" description="">
		<bitfield id="CLAIMREG_P4_R5" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R6" acronym="CFG0_CLAIMREG_P4_R6" offset="0x13118" width="32" description="">
		<bitfield id="CLAIMREG_P4_R6" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R7" acronym="CFG0_CLAIMREG_P4_R7" offset="0x1311C" width="32" description="">
		<bitfield id="CLAIMREG_P4_R7" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R8" acronym="CFG0_CLAIMREG_P4_R8" offset="0x13120" width="32" description="">
		<bitfield id="CLAIMREG_P4_R8" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R9" acronym="CFG0_CLAIMREG_P4_R9" offset="0x13124" width="32" description="">
		<bitfield id="CLAIMREG_P4_R9" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R10" acronym="CFG0_CLAIMREG_P4_R10" offset="0x13128" width="32" description="">
		<bitfield id="CLAIMREG_P4_R10" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R11" acronym="CFG0_CLAIMREG_P4_R11" offset="0x1312C" width="32" description="">
		<bitfield id="CLAIMREG_P4_R11" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P4_R12" acronym="CFG0_CLAIMREG_P4_R12" offset="0x13130" width="32" description="">
		<bitfield id="CLAIMREG_P4_R12" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 4" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CHNG_DDR4_FSP_REQ" acronym="CFG0_CHNG_DDR4_FSP_REQ" offset="0x14000" width="32" description="">
		<bitfield id="CHNG_DDR4_FSP_REQ_REQ" width="1" begin="8" end="8" resetval="0x0" description="Initiate FSP frequency change" range="8" rwaccess="R/W"/> 
		<bitfield id="CHNG_DDR4_FSP_REQ_REQ_TYPE" width="2" begin="1" end="0" resetval="0x0" description="Frequency request type" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CHNG_DDR4_FSP_ACK" acronym="CFG0_CHNG_DDR4_FSP_ACK" offset="0x14004" width="32" description="">
		<bitfield id="CHNG_DDR4_FSP_ACK_ACK" width="1" begin="7" end="7" resetval="0x0" description="Frequency change acknowledge." range="7" rwaccess="R"/> 
		<bitfield id="CHNG_DDR4_FSP_ACK_ERROR" width="1" begin="0" end="0" resetval="0x0" description="Frequency change error" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_DDR4_FSP_CLKCHNG_REQ" acronym="CFG0_DDR4_FSP_CLKCHNG_REQ" offset="0x14080" width="32" description="">
		<bitfield id="DDR4_FSP_CLKCHNG_REQ_REQ" width="1" begin="7" end="7" resetval="0x0" description="DDR Controller FSP clock change request" range="7" rwaccess="R"/> 
		<bitfield id="DDR4_FSP_CLKCHNG_REQ_REQ_TYPE" width="2" begin="1" end="0" resetval="0x0" description="Frequency request type" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_DDR4_FSP_CLKCHNG_ACK" acronym="CFG0_DDR4_FSP_CLKCHNG_ACK" offset="0x140C0" width="32" description="">
		<bitfield id="DDR4_FSP_CLKCHNG_ACK_ACK" width="1" begin="0" end="0" resetval="0x0" description="DDR FSP clock change ackowledge" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK5_KICK0" acronym="CFG0_LOCK5_KICK0" offset="0x15008" width="32" description="">
		<bitfield id="LOCK5_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK5_KICK1" acronym="CFG0_LOCK5_KICK1" offset="0x1500C" width="32" description="">
		<bitfield id="LOCK5_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P5_R0_READONLY" acronym="CFG0_CLAIMREG_P5_R0_READONLY" offset="0x15100" width="32" description="">
		<bitfield id="CLAIMREG_P5_R0_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 5" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P5_R1_READONLY" acronym="CFG0_CLAIMREG_P5_R1_READONLY" offset="0x15104" width="32" description="">
		<bitfield id="CLAIMREG_P5_R1_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 5" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CHNG_DDR4_FSP_REQ_PROXY" acronym="CFG0_CHNG_DDR4_FSP_REQ_PROXY" offset="0x16000" width="32" description="">
		<bitfield id="CHNG_DDR4_FSP_REQ_REQ_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Initiate FSP frequency change" range="8" rwaccess="R/W"/> 
		<bitfield id="CHNG_DDR4_FSP_REQ_REQ_TYPE_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Frequency request type" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CHNG_DDR4_FSP_ACK_PROXY" acronym="CFG0_CHNG_DDR4_FSP_ACK_PROXY" offset="0x16004" width="32" description="">
		<bitfield id="CHNG_DDR4_FSP_ACK_ACK_PROXY" width="1" begin="7" end="7" resetval="0x0" description="Frequency change acknowledge." range="7" rwaccess="R"/> 
		<bitfield id="CHNG_DDR4_FSP_ACK_ERROR_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Frequency change error" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_DDR4_FSP_CLKCHNG_REQ_PROXY" acronym="CFG0_DDR4_FSP_CLKCHNG_REQ_PROXY" offset="0x16080" width="32" description="">
		<bitfield id="DDR4_FSP_CLKCHNG_REQ_REQ_PROXY" width="1" begin="7" end="7" resetval="0x0" description="DDR Controller FSP clock change request" range="7" rwaccess="R"/> 
		<bitfield id="DDR4_FSP_CLKCHNG_REQ_REQ_TYPE_PROXY" width="2" begin="1" end="0" resetval="0x0" description="Frequency request type" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_DDR4_FSP_CLKCHNG_ACK_PROXY" acronym="CFG0_DDR4_FSP_CLKCHNG_ACK_PROXY" offset="0x160C0" width="32" description="">
		<bitfield id="DDR4_FSP_CLKCHNG_ACK_ACK_PROXY" width="1" begin="0" end="0" resetval="0x0" description="DDR FSP clock change ackowledge" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK5_KICK0_PROXY" acronym="CFG0_LOCK5_KICK0_PROXY" offset="0x17008" width="32" description="">
		<bitfield id="LOCK5_KICK0_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
