IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/CTRL_MMR0_CFG0.xml
	<register id="CFG0_LOCK5_KICK1_PROXY" acronym="CFG0_LOCK5_KICK1_PROXY" offset="0x1700C" width="32" description="">
		<bitfield id="LOCK5_KICK1_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P5_R0" acronym="CFG0_CLAIMREG_P5_R0" offset="0x17100" width="32" description="">
		<bitfield id="CLAIMREG_P5_R0" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 5" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P5_R1" acronym="CFG0_CLAIMREG_P5_R1" offset="0x17104" width="32" description="">
		<bitfield id="CLAIMREG_P5_R1" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 5" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_RST_CTRL" acronym="CFG0_RST_CTRL" offset="0x18170" width="32" description="">
		<bitfield id="RST_CTRL_MAIN_RESET_ISO_DONE_Z" width="1" begin="18" end="18" resetval="0x0" description="Main Domain CPUs can set this bit to block warm reset in the main domain which is useful when the Main domain may be accessing" range="18" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_MAIN_ESM_ERROR_RST_EN_Z" width="1" begin="17" end="17" resetval="0x1" description="Deactivate Reset of Main by ESM" range="17" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_DMSC_COLD_RESET_EN_Z" width="1" begin="16" end="16" resetval="0x0" description="Deactivate Reset of Main by DMSC" range="16" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_SW_MAIN_POR" width="4" begin="7" end="4" resetval="0x15" description="Causes Main Domain Power On Reset when set to 4'b0110, Bits will reset to 4'b1111" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_SW_MAIN_WARMRST" width="4" begin="3" end="0" resetval="0x15" description="Causes Main Domain Warm Reset when set to 4'b0110, Bits will reset to 4'b1111" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_RST_STAT" acronym="CFG0_RST_STAT" offset="0x18174" width="32" description="">
		<bitfield id="RST_STAT_MCU_RESET_ISO_DONE_Z" width="1" begin="0" end="0" resetval="0x0" description="is an outstanding warm reset request for the main domain.   Once notified, MCU needs to finish any outstanding" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_RST_SRC" acronym="CFG0_RST_SRC" offset="0x18178" width="32" description="">
		<bitfield id="RST_SRC_SAFETY_ERROR" width="1" begin="31" end="31" resetval="0x0" description="Reset Caused by MCU ESM Error" range="31" rwaccess="R"/> 
		<bitfield id="RST_SRC_MAIN_ESM_ERROR" width="1" begin="30" end="30" resetval="0x0" description="Reset Caused by Main ESM Error" range="30" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_POR_FROM_MAIN" width="1" begin="25" end="25" resetval="0x0" description="Software Main Power On Reset From MAIN CTRL MMR" range="25" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_POR_FROM_MCU" width="1" begin="24" end="24" resetval="0x0" description="Software Main Power On Reset From MCU CTRL MMR" range="24" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_WARMRST_FROM_MAIN" width="1" begin="21" end="21" resetval="0x0" description="Software Main Warm Reset from MAIN CTRL MMR" range="21" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_WARMRST_FROM_MCU" width="1" begin="20" end="20" resetval="0x0" description="Software Main Warm Reset From MCU CTRL MMR" range="20" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MCU_WARMRST" width="1" begin="16" end="16" resetval="0x0" description="Software Warm Reset" range="16" rwaccess="R"/> 
		<bitfield id="RST_SRC_WARM_OUT_RST" width="1" begin="13" end="13" resetval="0x0" description="DMSC Warm Reset" range="13" rwaccess="R"/> 
		<bitfield id="RST_SRC_COLD_OUT_RST" width="1" begin="12" end="12" resetval="0x0" description="DMSC Cold Reset" range="12" rwaccess="R"/> 
		<bitfield id="RST_SRC_DEBUG_RST" width="1" begin="8" end="8" resetval="0x0" description="Debug Subsystem Initiated Reset" range="8" rwaccess="R"/> 
		<bitfield id="RST_SRC_THERMAL_RST" width="1" begin="4" end="4" resetval="0x0" description="Thermal Reset" range="4" rwaccess="R"/> 
		<bitfield id="RST_SRC_MAIN_RESET_REQ" width="1" begin="2" end="2" resetval="0x0" description="Main Reset Pin" range="2" rwaccess="R"/> 
		<bitfield id="RST_SRC_MCU_RESET_PIN" width="1" begin="0" end="0" resetval="0x0" description="Rest Caused by MCU Reset Pin" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_RST_MAGIC_WORD" acronym="CFG0_RST_MAGIC_WORD" offset="0x1817C" width="32" description="">
		<bitfield id="RST_MAGIC_WORD_MCU_MAGIC_WORD" width="32" begin="31" end="0" resetval="0x0" description="Magic Word Indicating Status of MCU Subsystem Boot" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_LOCK6_KICK0" acronym="CFG0_LOCK6_KICK0" offset="0x19008" width="32" description="">
		<bitfield id="LOCK6_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK6_KICK1" acronym="CFG0_LOCK6_KICK1" offset="0x1900C" width="32" description="">
		<bitfield id="LOCK6_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P6_R0_READONLY" acronym="CFG0_CLAIMREG_P6_R0_READONLY" offset="0x19100" width="32" description="">
		<bitfield id="CLAIMREG_P6_R0_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 6" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P6_R1_READONLY" acronym="CFG0_CLAIMREG_P6_R1_READONLY" offset="0x19104" width="32" description="">
		<bitfield id="CLAIMREG_P6_R1_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 6" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_CLAIMREG_P6_R2_READONLY" acronym="CFG0_CLAIMREG_P6_R2_READONLY" offset="0x19108" width="32" description="">
		<bitfield id="CLAIMREG_P6_R2_READONLY" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 6" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_RST_CTRL_PROXY" acronym="CFG0_RST_CTRL_PROXY" offset="0x1A170" width="32" description="">
		<bitfield id="RST_CTRL_MAIN_RESET_ISO_DONE_Z_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Main Domain CPUs can set this bit to block warm reset in the main domain which is useful when the Main domain may be accessing" range="18" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_MAIN_ESM_ERROR_RST_EN_Z_PROXY" width="1" begin="17" end="17" resetval="0x1" description="Deactivate Reset of Main by ESM" range="17" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_DMSC_COLD_RESET_EN_Z_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Deactivate Reset of Main by DMSC" range="16" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_SW_MAIN_POR_PROXY" width="4" begin="7" end="4" resetval="0x15" description="Causes Main Domain Power On Reset when set to 4'b0110, Bits will reset to 4'b1111" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="RST_CTRL_SW_MAIN_WARMRST_PROXY" width="4" begin="3" end="0" resetval="0x15" description="Causes Main Domain Warm Reset when set to 4'b0110, Bits will reset to 4'b1111" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_RST_STAT_PROXY" acronym="CFG0_RST_STAT_PROXY" offset="0x1A174" width="32" description="">
		<bitfield id="RST_STAT_MCU_RESET_ISO_DONE_Z_PROXY" width="1" begin="0" end="0" resetval="0x0" description="is an outstanding warm reset request for the main domain.   Once notified, MCU needs to finish any outstanding" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_RST_SRC_PROXY" acronym="CFG0_RST_SRC_PROXY" offset="0x1A178" width="32" description="">
		<bitfield id="RST_SRC_SAFETY_ERROR_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Reset Caused by MCU ESM Error" range="31" rwaccess="R"/> 
		<bitfield id="RST_SRC_MAIN_ESM_ERROR_PROXY" width="1" begin="30" end="30" resetval="0x0" description="Reset Caused by Main ESM Error" range="30" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_POR_FROM_MAIN_PROXY" width="1" begin="25" end="25" resetval="0x0" description="Software Main Power On Reset From MAIN CTRL MMR" range="25" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_POR_FROM_MCU_PROXY" width="1" begin="24" end="24" resetval="0x0" description="Software Main Power On Reset From MCU CTRL MMR" range="24" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_WARMRST_FROM_MAIN_PROXY" width="1" begin="21" end="21" resetval="0x0" description="Software Main Warm Reset from MAIN CTRL MMR" range="21" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MAIN_WARMRST_FROM_MCU_PROXY" width="1" begin="20" end="20" resetval="0x0" description="Software Main Warm Reset From MCU CTRL MMR" range="20" rwaccess="R"/> 
		<bitfield id="RST_SRC_SW_MCU_WARMRST_PROXY" width="1" begin="16" end="16" resetval="0x0" description="Software Warm Reset" range="16" rwaccess="R"/> 
		<bitfield id="RST_SRC_WARM_OUT_RST_PROXY" width="1" begin="13" end="13" resetval="0x0" description="DMSC Warm Reset" range="13" rwaccess="R"/> 
		<bitfield id="RST_SRC_COLD_OUT_RST_PROXY" width="1" begin="12" end="12" resetval="0x0" description="DMSC Cold Reset" range="12" rwaccess="R"/> 
		<bitfield id="RST_SRC_DEBUG_RST_PROXY" width="1" begin="8" end="8" resetval="0x0" description="Debug Subsystem Initiated Reset" range="8" rwaccess="R"/> 
		<bitfield id="RST_SRC_THERMAL_RST_PROXY" width="1" begin="4" end="4" resetval="0x0" description="Thermal Reset" range="4" rwaccess="R"/> 
		<bitfield id="RST_SRC_MAIN_RESET_REQ_PROXY" width="1" begin="2" end="2" resetval="0x0" description="Main Reset Pin" range="2" rwaccess="R"/> 
		<bitfield id="RST_SRC_MCU_RESET_PIN_PROXY" width="1" begin="0" end="0" resetval="0x0" description="Rest Caused by MCU Reset Pin" range="0" rwaccess="R"/>
	</register>
	<register id="CFG0_RST_MAGIC_WORD_PROXY" acronym="CFG0_RST_MAGIC_WORD_PROXY" offset="0x1A17C" width="32" description="">
		<bitfield id="RST_MAGIC_WORD_MCU_MAGIC_WORD_PROXY" width="32" begin="31" end="0" resetval="0x0" description="Magic Word Indicating Status of MCU Subsystem Boot" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG0_LOCK6_KICK0_PROXY" acronym="CFG0_LOCK6_KICK0_PROXY" offset="0x1B008" width="32" description="">
		<bitfield id="LOCK6_KICK0_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK6_KICK1_PROXY" acronym="CFG0_LOCK6_KICK1_PROXY" offset="0x1B00C" width="32" description="">
		<bitfield id="LOCK6_KICK1_PROXY" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P6_R0" acronym="CFG0_CLAIMREG_P6_R0" offset="0x1B100" width="32" description="">
		<bitfield id="CLAIMREG_P6_R0" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 6" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P6_R1" acronym="CFG0_CLAIMREG_P6_R1" offset="0x1B104" width="32" description="">
		<bitfield id="CLAIMREG_P6_R1" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 6" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_CLAIMREG_P6_R2" acronym="CFG0_CLAIMREG_P6_R2" offset="0x1B108" width="32" description="">
		<bitfield id="CLAIMREG_P6_R2" width="32" begin="31" end="0" resetval="0x0" description="Claim bits for Partition 6" range="31 - 0" rwaccess="R/W"/>
	</register>
</module>